{
  "biography": "<h1>Біографія</h1><p>Я, Савельєв Дмитро Олександрович, народився 16 жовтня 1995 року в місті Донецьк.</p><p>До початку навчання в школі, ходив в дитячий садок. У дитячому садку часто проводили різні вистави за участю дітей, в яких брав участь і я, дуже часто граючи одну з головних ролей або навіть виступав в ролі ведучого.</p><p>Після дитячого саду, коли мені було 7 років, пішов до Ліцею №30 міста Донецьк. Під час навчання в школі дуже часто гуляв на вулиці з друзями в різні ігри і також катався на велосипеді.</p><p> Коли в родині з'явився перший комп'ютер, я потроху почав в ньому розбиратися і вникати в деталі його роботи і функціонування програмного забезпечення.</p><p>Мені дуже подобалося все, що пов'язано з технікою. Тому, після закінчення 9 класу школи, було вирішено вступити до Донецького індустріально-педагогічний технікум на спеціальність <q>Побутова техніка</q>. У технікумі було цікаво навчатися, пізнавати щось нове.</p><p> Під час навчання, на першому курсі, був предмет під назвою <q>Екологія</q>, за результатом проходження курсу якого необхідно було підготувати презентацію на тему, пов'язану з екологією. Вирішено було взяти тему поновлюваних джерел енергії, так як ця тема була пов'язана з технологіями. Підготовлена мною презентація дуже сподобалася викладачеві, і він запропонував мені виступити на конференції, присвяченій охороні навколишнього середовища. Я прийняв пропозицію і почав готуватися. Необхідно було виступати з доповіддю на велику аудиторію. Для виступу я доповнив свою презентацію і підготував доповідь. За підсумком участі в конференції, де виступало багато доповідачів, я отримав перше місце за кращу презентацію.</p><p>Під час навчання у мене з'явився гірський велосипед, на якому я їжджу і досі. Дуже подобаються тривалі поїздки на ньому і відвідування нових для себе місць.</p><p>Потім, після успішного закінчення даного навчального закладу, я вступив до Донецького національного технічного університету на спеціальність <q>Електроніка та наноелектроніка</q>. В період навчання на бакалавраті брав участь в олімпіаді з электронiки, де зайняв одне з призових місць. Також почав захоплюватися грою на барабанній установці, для навчання грі ходив на індивідуальні заняття в один з Палаців Культури. Це заняття мене дуже захоплювало, мені подобалося дізнаватися нові прийоми і стилі гри, а також вивчати сподобалися мені пісні.</p><p>Темою моєї бакалаврської роботи було <q>Розробити електронний пристрій виміру концентрації метану в умовах вугільної шахти</q>. По закінченню бакалаврату з відзнакою вирішив продовжити навчання і вступив на магістратуру в Донецький національний технічний університет.</p><p> Паралельно з початком навчання в магістратурі, почав вивчати веб-розробку, зокрема front-end. В першу чергу почав з основ, таких як HTML і CSS. Потім, для більш поглибленого занурення в тему, вирішив вивчати Javascript і його фреймворки, зокрема React. Спочатку робив односторінкові сайти. Але пізніше, після початку вивчення React, розробляв вже веб-додатки. Також зробив сайт для кафедри <q>Електроніка</q>, на якій проходив навчання в університеті. Пізніше, для розширення кругозору в веб-розробці, вирішив вивчити інший досить популярний фреймворк під назвою Vue.js.</p><p>Темою моєї магістерської дисертації стало удосконалення вже розробленого мною раніше пристрою, а саме:    <q>Дослідження і розробка методів і засобів метрологічної надійності оптичного абсорбційного       шахтного метанометра</q>. Керівником виступив завідувач кафедри <q>Електроніка</q>,    доктор технічних наук, професор Хламов Михайло Георгійович.  </p>  <p>      У моїх планах успішний захист магістерської дисертації, професійний і кар'єрний ріст.  </p>",
  "titleHead": "- Савельєв Дмитро Олександрович - Дослідження і розробка методів і засобів метрологічної надійності оптичного адсорбционного шахтного метанометра",
  "resume": {
    "title": "Коротке резюме магістра",
    "text": "  <p>ПІБ магістра</p><span>Савельєв Дмитро Олександрович</span> <p>Дата народження</p><span>16.10.1995 р.</span>    <p>Місце народження</p><span>Донецьк</span>    <p>Школа</p><span>2003&ndash;2011 рр. Ліцей №30 міста Донецьк</span>    <p>ВНЗ</p><span>2015&ndash;2018 рр. ДонНТУ &ndash; бакалавріат, спеціальність <q>Електроніка та наноелектроніка</q><br>2018&ndash;2020 рр. ДонНТУ &ndash; магістратура, спеціальність <q>Електроніка та наноелектроніка</q></span>    <p>Середній бал</p><span>4.8/відмінно</span>    <p>Володіння мовами</p><span>Російська &ndash; рідна;<br>Українська &ndash; досконало;<br>Англійська &ndash; середній рівень.</span>    <p>Особисті досягнення</p><span>Конференція з охорони навколишнього середовища &ndash; перше місце за кращу презентацію. <br>Олімпіада з электронiки &ndash; одне з призових місць.</span>    <p>Захоплення</p><span>Ігри: комп'ютерні; <br> Музика: рок; <br>Фільми, серіали: детектив, наукова фантастика, трилер, нуар, фентезі, драма, історичний.</span>    <p>Особисті якості</p><span>Відповідальність, здатність до навчання, допитливість, цілеспрямованість.</span>    <p>Володіння комп'ютером</p><span>Операційні системи: Windows, Android, Ubuntu;<br>Прикладні напрямки: Microsoft Office, Adobe Photoshop, Adobe Illustrator, Компас 3D, MathCad, LabView, Proteus, Matlab, DipTrace, Multisim, 3D Max;<br>Мови програмування: JavaScript, C, C++;<br>Середовища розробки: Visual Studio Code, ArduinoIDE, Delphi.</span>    <p>Досвід роботи</p><span>Виробнича практика: ДП МАШИНОБУДІВНИЙ ЗАВОД <q>ІТРАС</q>;<br>Переддипломна практика: ДП МАШИНОБУДІВНИЙ ЗАВОД <q>ІТРАС</q>.</span>    <p>Плани на майбутнє</p><span>Професійний і кар'єрний ріст.</span>    <p>Контактна інформація</p><a href='https://www.linkedin.com/in/dmitry-saveliev-125394197/' target='_blank'>Linkedin</<a>"  
  },
  "abstract": {
    "picture": "Малюнок",
    "where": "де",
    "title": "Реферат за темою випускної роботи",
    "titles": {
      "t1": "Зміст",
      "t2": "Актуальність",
      "t3": "Цель и задачи исследования, планируемые результаты",
      "t4": "Мета і завдання дослідження, плановані результати",
      "t5": "Огляд існуючих методів, засобів і систем вимірювання концентрації метану",
      "t6": "Основні негативні фактори рудничної атмосфери вугільних шахт",
      "t7": "Розробка оптичної схеми вимірювача концентрації метану",
      "t8": "Висновки",
      "t9": "Список джерел"
    },
    "p1": "<p>   Угольная промышленность несет в себе значимую роль в производстве электроэнергии –    от нее зависит топливный баланс государства. Уголь играет важную роль в химической и    металлургической промышленности. Он используется при производстве карбида кальция, электрокорунда,    синтетического жидкого топлива, чугуна, стали, углеродистого наполнителя для электродных изделий,    извести, цемента, кирпича, синтетического каучука, пластмасс и т.д.  </p>  <p>    Уголь добывают открытым карьерным и закрытым шахтным способом [7].    Открытый способ применяется при глубине залежей угля до 100 метров.    При этом производится снятие верхнего слоя почвы. Далее производится дробление породы при    помощи бульдозеров, водяных пушек, экскаваторов, дробилок и буровзрывной отбойки угля.    Этот способ охватывает значительную площадь, экономичен, относительно безопасен, имеет    высокую скорость добычи, но наносит ощутимый вред окружающей среде, и уголь,    добытый таким способом, содержит много примесей.  </p>  <p>    Закрытый способ применяется в тех случаях, когда уголь залегает на достаточно большой глубине.    До места залегания прокладывают вертикальные или горизонтальные стволы, из которых формируется    шахта. Добыча угля закрытым способом может производиться с помощью лав или камерно-столбовым    способом (лава - это длинный забой). В забоях уголь рубят при помощи выемочного комбайна.    На поверхность уголь отправляется при помощи конвейера. При этом способе добывается почти    весь уголь из пласта. При камерно-столбовом методе используются столбы и горизонтальные проходы    между ними. Этот способ применяют при неглубоком залегании угля.  </p>  <p>    При закрытом способе уголь добывается высокого качества, приносится меньше вреда окружающей среде,    но обладает высокой опасностью и требует больших финансовых вложений.  </p>  <p>    Проблема при закрытой добыче угля заключается в следующем: при добыче угля есть опасность    взрыва метана. Для того, чтобы предотвратить это, в шахтах применяется система аэрогазового    контроля, осуществляющая автоматическое отключение электричества на участке шахты,    где произошло превышение нормы концентрации метана.  </p>  <p>    Согласно нормам [5], время срабатывания небыстродействующего датчика – 15 с, быстродействующего    (при концентрации метана 2%, при скорости роста 0,5% в 1 с) – 0,8 с.  </p>  <p>    Существующие стационарные средства контроля концентрации метана обладают общим недостатком –    низким быстродействием,    обусловленным значительной инерционностью определения концентрации метана.  </p>  <p>    Измеритель должен быть малоинерционным и нечувствительным к    влиянию основных возмущающих факторов рудничной атмосферы угольных шахт.  </p>",
    "p2": "<p>    Целью исследования является повышение метрологической надежности оптического адсорбционного шахтного метанометра путем компенсации    основных дестабилизирующих факторов, влияющих на результаты измерения.  </p>  <p>    Для достижения цели данной работы поставлены следующие задачи:  </p>  <ul>    <li>      анализ условий, в которых осуществляется добыча угля;    </li>    <li>      анализ существующих методов измерения концентрации метана в условиях угольной шахты;    </li>    <li>      выявление факторов, влияющих на показания оптических метанометров в условиях угольной шахты;    </li>    <li>      разработка путей компенсации влияния дестабилизирующих факторов;    </li>    <li>      разработка математической модели системы измерения концентрации метана;    </li>    <li>      оценка параметров метрологической надежности.    </li>  </ul>  <p>    Планируемым результатом является внедрение путей компенсации дестабилизирующих факторов,    получение математической модели системы измерения концентрации метана и структурной схемы системы.  </p>",
    "p3": {
      "p1": "Предлагается следующая Обобщённая структурная схема спектрального устройства определения концентрации метана, представленная на рисунке 1.",
      "p2": "Обобщенная структурная схема спектрального устройства",
      "p3": "<p>      В состав спектрального устройства входят: 1 – источник излучения, 2 – передающая оптическая система,      3 – устройство для разложения лучей в спектр,      4 – приемная оптическая система, 5 – приемник излучения, 6 – регистрирующее устройство.    </p>    <p>      Поток излучения создается с помощью источника излучения. Источник может быть удален от      устройства на значительное расстояние или входить в его состав. Для градуировки и калибровки      спектральных энергетических характеристик устройств используются источники света.    </p>    <p>      Передающая система формирует и направляет поток от источника на устройство для      разложения излучения в спектр (диспергирующее устройство).      В большинстве устройств используются коллиматорные системы.    </p>    <p>      Наиболее важной частью спектрального устройства является диспергирующее устройство,      которое осуществляет      разложение излучения на монохромные составляющие, т.е. образует спектр.    </p>    <p>      Приемная оптическая система служит для формирования на приемнике потока, который разложен в спектр.    </p>    <p>      Приемник энергии предназначен для преобразования сигнала, переносимого потоком, в электрический сигнал.    </p>    <p>      Регистрирующее устройство предназначено для усиления электрических сигналов приемника,      преобразования их в нужный вид, и записи спектра.    </p>    <p>      Следует отметить, что отдельные элементы оптической системы могут быть совмещены в      одном устройстве или отсутствовать. Кроме вышеперечисленных узлов в состав спектрального устройства могут входить дополнительные элементы (компенсаторы, модуляторы, сканирующие механизмы,      устройства программного управления режимом работы и т. п.).    </p>"
    },
    "p4": {
      "p1": "<p>      Существует несколько методов определения концентрации метана в условиях шахты: термокаталитический,      термокондуктометрический, оптический, воздушно-канальный и хроматографический методы.    </p>    <p>      Термокаталитический метод основан на окислении метана на поверхности каталитически активного      элемента и измерении количества тепла, которое выделилось при этом. Главным преимуществом      этого метода является высокая точность измерения (при измерении концентрации до 4%,      далее – происходит «опрокидывание», т.е. резкое ухудшение точности показателей).      Быстродействие современных датчиков достигает 4 с.      Общий вид и состав термокаталитического сенсора приведен на рисунке 2 [1].    </p>",
      "p2": "Общий вид и состав термокаталитического сенсора"
    },
    "p5": {
      "p1": "<p>      Такой сенсор может иметь металлический или пластиковый корпус,      через мембрану которого метан диффундирует на два чувствительных элемента (керамических шарика).      Внутри этих шариков (т.н. пеллисторов) размещена платиновая нить, которая нагревается током до 450 ℃.      Активный пеллистор покрыт катализатором, который окисляет метан, что приводит к повышению его      температуры. Это повышение приводит к изменению сопротивления платиновой нити внутри активного      чувствительного элемента. Далее сопротивление сравнивается с сопротивление пассивного и определяется      нцентрация метана.      Ниже приведена обобщенная схема включения термокаталитического сенсора (см. рис. 3).    </p>",
      "p2": "Обобщенная схема включения термокаталитического сенсора"
    },
    "p6": {
      "p1": "<p>      Термокондуктометрический метод основан на зависимости теплопроводности газовой смеси от      концентрации метана. Этот метод уступает термокаталитическому из-за плохой селективности и      малой чувствительности, но обладает диапазоном измерения до 100%.  В сенсоре (см. рис 4)      применяются два элемента, нагретые до определенной температуры. Элемент R4 является опорным и      изолирован от измеряемой среды, в его камере обычно находится воздух. Элемент R3 изменяет свою      проводимость при попадании метана. Эта разница сигнала между      эталонным элементом и активным прямо пропорциональна концентрации метана [2].    </p>",
      "p2": "Обобщенная схема термокондуктометрического сенсора"
    },
    "p7": "<p>    Воздушно-канальный метод основан на принципе непрерывного сбора пробы газа путем дистанционного    забора и протяжки их по трубе к станции для анализа с помощью газоанализатора. Преимуществами    данного метода является низкая стоимость аппаратуры, отсутствие источников питания для устройств    в подземной выработке, широкая функциональность. Недостатки же сводятся к высокой задержке анализа    пробы воздуха из-за наличия времени, которое необходимо для транспортировки газовой смеси от    шахтной выработки до центрального газоаналитического пункта.  </p>  <p>    В основе хроматического метода лежит способность веществ адсорбироваться на выбранном адсорбенте    (избирательная адсорбция). Адсорбент может быть твердым телом, владеющим адсорбционными свойствами,    или жидкостью, которая наносится на грани раздела фазы на гранулированный инертный материал-носитель    для создания большей поверхности обмена.    Недостатком этого метода является плохая селективность и невысокое быстродействие.  </p>  <p>    После проведения анализа вышеперечисленных методов, оценки их достоинств и недостатков,    был выбран оптический метод измерения концентрации метана. Суть этого метода заключается    в избирательном поглощении инфракрасного излучения молекулами метана в области длин волн 3,2 – 3,4 мкм    [3]. Этот метод обладает высоким быстродействием, имеет высокую точность и селективность измерений,    также обладает малой инерционностью и большим ресурсом эксплуатации приборов,    что выделяет его среди вышеперечисленных.  </p>  <p>    Классическая теория при объяснении поглощения инфракрасного излучения исходит из того,    что атомы и молекулы газов обладают собственными частотами колебаний, характерными для каждого газа,    и поглощение имеется всякий раз,    когда колеблющаяся система и падающая радиация находятся в резонансе.  </p>  <p>    Квантовая теория объясняет поглощение электромагнитных волн переходами атомов и молекул газа    из состояния с меньшей энергией в состояние с большей энергией, при этом установлено, что атомы    и молекулы могут воспринимать не любую сколь угодно малую величину энергии, а только строго    определенные, характерные для данного вещества дискретные порции энергии.    Большая часть энергии, поглощаемая газами, переходит в тепло [6].  </p>",
    "p8": "Закон Бугера устанавливает связь между интенсивностью J падающего потока излучения и    количеством энергии dJd<span class='symbol'>n</span>, поглощаемой бесконечно тонким слоем dx анализируемого газа в    спектральном интервале d<span class='symbol'>n</span> (1):",
    "p9": "<p>    <span class='symbol'>n</span> – волновое число;  </p>  <p>    K – коэффициент поглощения (постоянная величина, характеризующая поглощение    слоя и рассчитанная на единицу толщины при постоянном волновом числе).  </p>",
    "p10": "<p>    <span class='formula-font'>dI( l )</span> – ослабление направленного излучения интенсивности    <span class='formula-font'>I</span>    прошедшего слой среды толщиной <span class='formula-font'>dl</span>.  </p>",
    "p11": "В случае однородной среды интегральная форма закона Бугера имеет вид (3):",
    "p12": "интенсивности излучения до и после прохождения слоя толщиной",
    "p13": "Показатель экспоненты в предыдущей формуле принято называть оптической толщей среды (4):",
    "p14": " Интегрирование этого уравнения по х дает зависимость величины проходящего потока j    от коэффициента поглощения К, толщины слоя х и величины падающего потока J<sub>0</sub> в    спектральном интервале d<span class='symbol'>n</span> (закон Ламберта) (5):",
    "p15": "<p>    Экспериментальные исследования [4] поглощения лучистой энергии средой, плотность    которой не везде одинакова, показали, что лучистая энергия претерпевает равные изменения,    лишь встречая равное число частиц, способных задерживать лучи или рассеивать их, и, следовательно,    для поглощения имеют значения не толщины, а массы вещества, т. е. для поглощающего лучистую энергию    газа, растворенного в практически непоглощающих газах, коэффициент поглощения пропорционален числу    поглощающих молекул на единицу длины пути волны (или на единицу объема),    т. е. пропорционален концентрации С.  </p>  <p>    Для смеси j поглощающих газов, согласно закона Беера, коэффициент К определяется из соотношения (6):  </p>",
    "p16": "<p>    <span class='formula-font'>K<sub>j</sub></span>    – коэффициент поглощения j-го компонента;  </p>  <p>    <span class='formula-font'>C<sub>j</sub></span>    – концентрация j-го компонента в смеси.  </p>",
    "p17": "В свою очередь формула с учетом изложенного может быть представлена в следующей форме (7):",
    "p18": "А — новый коэффициент, не зависящий от концентрации и характерный для молекулы поглощающего газа.",
    "p19": "Как показал проведенный анализ, имеется возможность использовать известные методы для    построения проектируемого устройства. Использование оптического метода с применением современных    средств оптики и микроэлектроники позволит создать устройство с высоким быстродействием для    определения концентрации метана в условиях угольной шахты с улучшенными эксплуатационными    и метрологическими характеристиками.",
    "p20": "Проанализировав средства контроля, которые основаны на оптико-абсорбционном методе измерения,    был обнаружен ряд дестабилизирующих факторов: угольная пыль, наличие газов и пары воды,    температура и атмосферное давление. Одним из основных дестабилизирующих факторов рудничной    атмосферы является наличие угольной пыли в открытом оптическом канале измерителя, так как свет,    проходя через пылегазовую среду, ослабляется в результате рассеяния и поглощения (абсорбции). Пыль    также оседает на оптических элементах, и ведет к снижению метрологической надежности, ухудшается    прозрачность оптических компонентов. Для повышения точности измерителя необходимо исследовать    рассеяния ИК-излучения частицами пыли в рабочем оптическом канале и процесс формирования пленки    пыли на оптических компонентах, разработать метод компенсации влияния пыли на результаты измерений.    Свет, проходящий через среду в которой выполняются измерения, ослабляется в результате    рассеяния и поглощения (абсорбции). Интенсивность рассеяния света не постоянна и изменяется в    зависимости от размеров частиц пыли, концентрации пыли в канале, коэффициента преломления и угла    рассеяния между направлениями падающего и рассеянного света.    Наличие пыли в канале приводит к процессу формирования пленки пыли на оптических компонентах.",
    "p21": {
      "p1": "В оптическом газоанализаторе для увеличения стабильности нуля, а также для      компенсации возможного влияния влаги, пыли и других факторов, способных поглощать свет,      используется автокомпенсационная двухлучевая оптическая схема, в которой измеряется интенсивность      двух лучей, проходящих по одному и тому же оптическому пути, причём, длина волны одного      (измерительного) луча находится в области поглощения (3.3 мкм), а другого (опорного) —      в области прозрачности определяемого газа (2.9 мкм).",
      "p2": "Анимация оптических каналов измерителя концентрации метана",
      "p3": "Анимация: количество кадров – 5;      задержка между кадрами - 1 с; количество циклов повторения – 10; объём – 34 кБ"
    },
    "p22": " <p>    Потоки излучения от измерительного  (СИД 1) и компенсационного (СИД 2) светоизлучающих диодов    поступают на объективы О1 и О3 соответственно, которые в свою очередь    формируют направленные потоки излучения, поступающие в открытых измерительный ОК2 и    компенсационный ОК1 открытые оптические каналы. Прошедшие через оптические каналы, инфракрасные потоки поступают на    объективы О2 и О4, которые фокусируют параллельно направленные потоки излучения,    в которых располагаются фотодетекторы ФД1 и ФД2 основного измерительного и компенсационного каналов.    Полученные выходные сигналы    ФД1 и ФД2 – сигналы тока, значения которых пропорциональны потокам    основного и компенсационного оптических каналов.  </p>  <p>    В качестве источника инфракрасного излучения измерительного канала ОК1    целесообразно использовать светоизлучающий диод LED-332-NS [6] с рабочей длиной волны 3,3    мкм. Для компенсационного канала ОК2 можно использовать светоизлучающий диод    LED29–PR [6], который имеет рабочую длину волны 2,9 мкм.  </p>  <p>    В качестве фотоприемника можно использовать фотодиоды PD36-10-TEC [6].  </p>",
    "p23": "Существующие на сегодняшний день методы и средства измерения концентрации    метана не обеспечивают необходимое быстродействие    устройств измерения концентрации метана в условиях угольной шахты.    Использование оптико-адсорбционного метода, овременных средств оптики и микроэлектроники,    а так же предложенного способа компенсации влияния угольной пыти на результат измерения концентрации метана    позволит создать быстродействующий прибор для определения концентрации метана с улучшенными метрологическими    и эксплуатационными характеристиками.",
    "sources": {
      "s1": "Термокаталитические (термохимические) сенсоры. [Электронный ресурс] – Режим доступа:",
      "s2": "Термокондуктометрический метод измерения концентрации газов. [Электронный ресурс] – Режим доступа:",
      "s3": "Бреслер П.И. Оптические абсорбционные газоанализаторы и их применение. – Л.: Энергия, 1980. – 164 с.",
      "s4": "Карпов Е.Ф., Биренберг И.Э. Автоматическая газовая защита и контроль рудничной атмосферы. – М.: Наука, 1984. – 285с.",
      "s5": "ГОСТ 24032 – 80. Приборы шахтные газоаналитические. Общие требования, методы      испытания. – Введ. 01. 01. 1981 /Межгосударственный стандарт. – М.: Издательство      стандартов, 1980. – 36 с. – (Угольная промышленность).",
      "s6": "IBSG [Електронний ресурс]. – Електронные данные. – Режим доступа:",
      "s7": "Энергетика [Електронний ресурс]. – Електронные данные. – Режим доступа:"
    }
  }
}