{
  "biography": "<h1>Біографія</h1><p>Я, Савельєв Дмитро Олександрович, народився 16 жовтня 1995 року в місті Донецьк.</p><p>До початку навчання в школі, ходив в дитячий садок. У дитячому садку часто проводили різні вистави за участю дітей, в яких брав участь і я, дуже часто граючи одну з головних ролей або навіть виступав в ролі ведучого.</p><p>Після дитячого саду, коли мені було 7 років, пішов до Ліцею №30 міста Донецьк. Під час навчання в школі дуже часто гуляв на вулиці з друзями в різні ігри і також катався на велосипеді.</p><p> Коли в родині з'явився перший комп'ютер, я потроху почав в ньому розбиратися і вникати в деталі його роботи і функціонування програмного забезпечення.</p><p>Мені дуже подобалося все, що пов'язано з технікою. Тому, після закінчення 9 класу школи, було вирішено вступити до Донецького індустріально-педагогічний технікум на спеціальність <q>Побутова техніка</q>. У технікумі було цікаво навчатися, пізнавати щось нове.</p><p> Під час навчання, на першому курсі, був предмет під назвою <q>Екологія</q>, за результатом проходження курсу якого необхідно було підготувати презентацію на тему, пов'язану з екологією. Вирішено було взяти тему поновлюваних джерел енергії, так як ця тема була пов'язана з технологіями. Підготовлена мною презентація дуже сподобалася викладачеві, і він запропонував мені виступити на конференції, присвяченій охороні навколишнього середовища. Я прийняв пропозицію і почав готуватися. Необхідно було виступати з доповіддю на велику аудиторію. Для виступу я доповнив свою презентацію і підготував доповідь. За підсумком участі в конференції, де виступало багато доповідачів, я отримав перше місце за кращу презентацію.</p><p>Під час навчання у мене з'явився гірський велосипед, на якому я їжджу і досі. Дуже подобаються тривалі поїздки на ньому і відвідування нових для себе місць.</p><p>Потім, після успішного закінчення даного навчального закладу, я вступив до Донецького національного технічного університету на спеціальність <q>Електроніка та наноелектроніка</q>. В період навчання на бакалавраті брав участь в олімпіаді з электронiки, де зайняв одне з призових місць. Також почав захоплюватися грою на барабанній установці, для навчання грі ходив на індивідуальні заняття в один з Палаців Культури. Це заняття мене дуже захоплювало, мені подобалося дізнаватися нові прийоми і стилі гри, а також вивчати сподобалися мені пісні.</p><p>Темою моєї бакалаврської роботи було <q>Розробити електронний пристрій виміру концентрації метану в умовах вугільної шахти</q>. По закінченню бакалаврату з відзнакою вирішив продовжити навчання і вступив на магістратуру в Донецький національний технічний університет.</p><p> Паралельно з початком навчання в магістратурі, почав вивчати веб-розробку, зокрема front-end. В першу чергу почав з основ, таких як HTML і CSS. Потім, для більш поглибленого занурення в тему, вирішив вивчати Javascript і його фреймворки, зокрема React. Спочатку робив односторінкові сайти. Але пізніше, після початку вивчення React, розробляв вже веб-додатки. Також зробив сайт для кафедри <q>Електроніка</q>, на якій проходив навчання в університеті. Пізніше, для розширення кругозору в веб-розробці, вирішив вивчити інший досить популярний фреймворк під назвою Vue.js.</p><p>Темою моєї магістерської дисертації стало удосконалення вже розробленого мною раніше пристрою, а саме:    <q>Дослідження і розробка методів і засобів метрологічної надійності оптичного абсорбційного       шахтного метанометра</q>. Керівником виступив завідувач кафедри <q>Електроніка</q>,    доктор технічних наук, професор Хламов Михайло Георгійович.  </p>  <p>      У моїх планах успішний захист магістерської дисертації, професійний і кар'єрний ріст.  </p>",
  "titleHead": "- Савельєв Дмитро Олександрович - Дослідження і розробка методів і засобів метрологічної надійності оптичного адсорбционного шахтного метанометра",
  "resume": {
    "title": "Коротке резюме магістра",
    "text": "  <p>ПІБ магістра</p><span>Савельєв Дмитро Олександрович</span> <p>Дата народження</p><span>16.10.1995 р.</span>    <p>Місце народження</p><span>Донецьк</span>    <p>Школа</p><span>2003&ndash;2011 рр. Ліцей №30 міста Донецьк</span>    <p>ВНЗ</p><span>2015&ndash;2018 рр. ДонНТУ &ndash; бакалавріат, спеціальність <q>Електроніка та наноелектроніка</q><br>2018&ndash;2020 рр. ДонНТУ &ndash; магістратура, спеціальність <q>Електроніка та наноелектроніка</q></span>    <p>Середній бал</p><span>4.8/відмінно</span>    <p>Володіння мовами</p><span>Російська &ndash; рідна;<br>Українська &ndash; досконало;<br>Англійська &ndash; середній рівень.</span>    <p>Особисті досягнення</p><span>Конференція з охорони навколишнього середовища &ndash; перше місце за кращу презентацію. <br>Олімпіада з электронiки &ndash; одне з призових місць.</span>    <p>Захоплення</p><span>Ігри: комп'ютерні; <br> Музика: рок; <br>Фільми, серіали: детектив, наукова фантастика, трилер, нуар, фентезі, драма, історичний.</span>    <p>Особисті якості</p><span>Відповідальність, здатність до навчання, допитливість, цілеспрямованість.</span>    <p>Володіння комп'ютером</p><span>Операційні системи: Windows XP, 7, 10; Android;<br>Прикладні напрямки: Microsoft Office, Adobe Photoshop, Adobe Illustrator, Компас 3D, MathCad, LabView, Proteus, Matlab, DipTrace, Multisim, 3D Max;<br>Мови програмування: JavaScript, C, C++;<br>Середовища розробки: Visual Studio Code, ArduinoIDE, Delphi.</span>    <p>Досвід роботи</p><span>Виробнича практика: ДП МАШИНОБУДІВНИЙ ЗАВОД <q>ІТРАС</q>;<br>Переддипломна практика: ДП МАШИНОБУДІВНИЙ ЗАВОД <q>ІТРАС</q>.</span>    <p>Плани на майбутнє</p><span>Професійний і кар'єрний ріст.</span>    <p>Контактна інформація</p><a href='mailto:dimonoid9595@gmail.com'>dimonoid9595@gmail.com</a>"  
  }
}