{
  "biography": "<h1>Биография </h1> <p>Я, Савельев Дмитрий Александрович, родился 16 октября 1995 года в городе Донецк. </p> <p>До начала обучения в школе, ходил в детский сад. В детском саду часто проводили различные представления с участием детей, в которых участвовал и я, очень часто играя одну из главных ролей или даже выступал в роли ведущего. </p> <p>После детского сада, когда мне было 7 лет, пошел в Лицей №30 города Донецк. Во время обучения в школе очень часто гулял на улице с друзьями в различные игры и также катался на велосипеде. </p> <p>Когда в семье появился первый компьютер, я понемногу начал в нем разбираться и вникать в детали его работы и функционирования программного обеспечения. </p> <p>Мне очень нравилось всё, что связано с техникой. Поэтому, после окончания 9 класса школы, было решено поступить в Донецкий индустриально - педагогический техникум на специальность <q>Бытовая техника</q>. В техникуме было интересно обучаться, узнавать что-то новое. </p> <p>Во время обучения, на первом курсе, был предмет под названием <q>Экология</q>, по результату прохождения курса которого необходимо было подготовить презентацию по теме, связанной с экологией. Решено было взять тему возобновляемых источников энергии, так как эта тема была связана с технологиями. Подготовленная мною презентация очень понравилась преподавателю, и он предложил мне выступить на конференции, посвященной охране окружающей среды. Я принял предложение и начал готовиться. Необходимо было выступать с докладом на большую аудиторию. Для выступления я дополнил свою презентацию и подготовил доклад. По итогу участия в конференции, где выступало большое количество докладчиков, я получил первое место за лучшую презентацию. </p> <p > Во время обучения у меня появился горный велосипед, на котором я езжу и по сей день. Очень нравятся длительные поездки на нем и посещение новых для себя мест. </p> <p > Затем, после успешного окончания данного учебного заведения, я поступил в Донецкий национальный технический университет на специальность <q>Электроника и наноэлектроника</q>. В период обучения на бакалавриате участвовал в олимпиаде по электронике, где занял одно из призовых мест. Также начал увлекаться игрой на барабанной установке, для обучения игре ходил на индивидуальные занятия в один из Дворцов Культуры. Это занятие меня очень увлекало, мне нравилось узнавать новые приемы и стили игры, а также изучать понравившиеся мне песни. </p> <p >Темой моей бакалаврской работы было <q>Разработать электронное устройство измерения концентрации метана в условиях угольной шахты</q>. По окончанию бакалавриата с отличием решил продолжить обучение и поступил на магистратуру в Донецкий национальный технический университет. </p> <p > Параллельно с началом обучения в магистратуре, начал изучать веб - разработку, в частности front-end. В первую очередь начал с основ, таких как HTML и CSS. Затем, для более углубленного погружения в тему, решил изучать Javascript и его фреймворки, в частности, React.По началу делал одностраничные сайты. Но позже, после начала изучения React, разрабатывал уже веб - приложения. Также сделал сайт для кафедры <q>Электроника</q>, на которой проходил обучение в университете. Позже, для расширения кругозора в веб - разработке, решил изучить другой достаточно популярный фреймворк под названием Vue.js. </p> <p > Темой моей магистерской диссертации стало усовершенствование уже разработанного мной ранее устройства, а именно: <q>Исследование и разработка методов и средств метрологической надежности оптического абсорбционного шахтного метанометра</q>. Руководителем выступил заведующий кафедрой <q>Электроника</q> , доктор технических наук, профессор Хламов Михаил Георгиевич. </p> <p > В моих планах успешная защита магистерской диссертации, профессиональный и карьерный рост. </p>",
  "titleHead": "- Савельев Дмитрий Александрович - Исследование и разработка методов и средств метрологической надежности оптического адсорбционного шахтного метанометра",
  "resume": {
    "title": "Краткое резюме магистра",
    "text": "<p>ФИО</p><span>Савельев Дмитрий Александрович</span><p>Дата рождения</p><span>16.10.1995 г.</span><p>Место рождения</p><span>Донецк</span><p>Школа</p><span>2003&ndash;2011 гг. Лицей №30 города Донецка</span><p>ВУЗ</p><span>2015&ndash;2018 гг. ДонНТУ &ndash; бакалавриат, специальность <q>Электроника и наноэлектроника</q><br>2018&ndash;2020 гг. ДонНТУ &ndash; магистратура, специальность <q>Электроника и наноэлектроника</q></span><p>Средний балл</p><span>4.8/отлично</span><p>Владение языками</p><span>Русский &ndash; родной;<br>Украинский &ndash; в совершенстве;<br>Английский &ndash; средний уровень.</span><p>Личные достижения</p><span>Конференция по охране окружающей среды &ndash; первое место за лучшую презентацию. <br>Олимпиада по электронике &ndash; одно из призовых мест.</span><p>Увлечения</p><span>Игры: компьютерные; <br> Музыка: рок; <br>Фильмы, сериалы: детектив, научная фантастика, триллер, нуар, фэнтези, драма, исторический.</span><p>Личные качества</p><span>Ответственность, обучаемость, любознательность, целеустремленность.</span><p>Профессиональная специализация и владение компьютером</p><span>Операционные системы: Windows XP, 7, 10; Android;<br>Прикладные направления: Microsoft Office, Adobe Photoshop, Adobe Illustrator, Компас 3D, MathCad, LabView, Proteus, Matlab, DipTrace, Multisim, 3D Max;<br>Языки программирования: JavaScript, C, C++;<br>Среды разработки: Visual Studio Code, ArduinoIDE, Delphi.</span><p>Опыт работы</p><span>Производственная практика: ГП МАШИНОСТРОИТЕЛЬНЫЙ ЗАВОД <q>ИТРАС</q>;<br>Преддипломная правктика: ГП МАШИНОСТРОИТЕЛЬНЫЙ ЗАВОД <q>ИТРАС</q>.</span><p>Планы на будущее</p><span>Профессиональный и карьерный рост.</span><p>Контактная информация</p><a href='mailto:dimonoid9595@gmail.com'>dimonoid9595@gmail.com</a>"
  }
}