<template>
  <section>
    <h1>Способ защиты стекол от запыления оптического измерителя концентрации метана в угольных шахтах</h1>
    <p class="subtitle-wrap">
      <span class="subtitle">Автор: </span>
      А.В. Вовна
    </p>
    <p class="subtitle-wrap">
      <span class="subtitle">Источник:</span>
      <a href="http://www.irbis-nbuv.gov.ua/cgi-bin/irbis_nbuv/cgiirbis_64.exe?I21DBN=LINK&P21DBN=UJRN&Z21ID=&S21REF=10&S21CNR=20&S21STN=1&S21FMT=ASP_meta&C21COM=S&2_S21P03=FILA=&2_S21STR=Npdntu_ota_2015_1_17" target="_blank">
        Национальная библиотека Украины имени В.И. Вернадского.
      </a>
    </p>
    <h3>Аннотация</h3>
    <p class="annotation">
      <span class="subtitle">
        А.В. Вовна. Способ защиты стекол от запыления оптического измерителя концентрации метана в угольных шахтах.
      </span>
      <i>
        Разработан и реализован способ защиты стекол от запыления оптического измерителя
        концентрации метана в угольных шахтах. Предложенный способ основан на явлении термофореза от смотровых стекол оптоэлектронных компонент измерителя. Используемые
        стекла покрыты токопроводящим слоем, к которому подводят электрический ток. Для
        оценки эффективности предложенного способа разработан и создан макетный образец
        измерителя. При проведении лабораторных испытаний макетного образца выявлено, что
        использование нагрева стекол снижает запыленность оптоэлектронных компонент измерителя в 4 раза, а при использовании в измерителе детурбулизирующей сетки в комплексе с
        термофорезом смотровых стекол степень запыленности оптики снижается в 6 раз.

      </i>
    </p>
    <h3>Общая постановка проблемы</h3>
    <p>
      Одним из основных дестабилизирующих факторов
      рудничной атмосферы, оказывающим существенное влияние на показатели точности и
      метрологической надежности оптического измерителя концентрации метана, является наличие
      угольной пыли. При эксплуатации измерителя в условиях высокой запыленности и влажности
      происходит загрязнение его оптоэлектронных компонент. Для повышения точности разрабатываемого средства
      измерения в рудничной атмосфере шахт необходимо разработать
      способ защиты стекол от запыленности оптического измерителя концентрации метана.
    </p>
    <h3>Постановка задач исследования</h3>
    <p>
      Целью работы является повышение точности оптического измерителя концентрации метана
      в угольных шахтах путем разработки способа
      защиты его стекол от запыленности, который позволит уменьшить доминирующую дополнительную погрешность
      измерителя концентрации метана, обусловленную нарастающим
      загрязнением оптоэлектронных компонент.
    </p>
    <p>
      Для достижения цели поставлены и решены следующие задачи:
      <ul>
        <li>
          выполнить анализ методов и средств защиты стекол оптоэлектронных компонент
          измерителя от воздействия пыли на результат измерения концентрации газа;
        </li>
        <li>
          разработать и провести лабораторные испытания макетного образца измерителя с
          аппаратной реализацией способа защиты стекол от запыления;
        </li>
        <li>
          выполнить оценку эффективности предложенного способа защиты стекол от запыления оптического измерителя.
        </li>
      </ul>
    </p>
    <h3>Результаты разработки и исследований</h3>
    <p>
      Смотровые стекла устанавливаются в блоках излучателя и фотоприемника для защиты оптоэлектронных компоненты измерителя от
      пыли. При эксплуатации они должны обладать малой степенью запыления, чтобы не искажались результаты измерений.
      Возможны два пути защиты стекол: существенно уменьшить
      их степень запыления или вводить автоматическую коррекцию в результат измерений для
      исключения влияния их запыленности. Наиболее простым и эффективным способом автоматической коррекции
      результатов измерений концентрации газа, является использование
      двухканальной схемы измерителя [1 – 3]. При проведении лабораторных испытаний опытного образца измерителя с
      аппаратной реализации способа компенсации запыленности установлено, что в диапазоне изменений концентрации
      метана от 0 до 2,5 об.% абсолютное значение дополнительной погрешности измерений не превышает ±0,1 об.%, что в 2 раза меньше
      абсолютного значения основной погрешности измерений (не более ±0,2 об.%). Лабораторные
      испытания проводились при изменении концентрации пыли в диапазоне от 0 до 1 г/м3.
    </p>
    <p>
      Предлагаемый тип измерителей предназначен для использования в рудничной атмосфере шахт в качестве стационарных приборов.
      Поэтому с увеличением времени непрерывной работы в условиях повышенной влажности (значение относительной влажности достигает 100 %)
      и запыленности рудничной атмосферы (концентрация пыли более 1 г/м3) происходит запыление стекол,
      что приводит к снижению метрологической надежности измерителя.
      Для предотвращения попадания пыли на стекла широко используется их обдув чистым воздухом.
      Этот способ, не смотря на его широкое применение, имеет ряд недостатков [4]:
      <ul>
        <li>
          воздух нарушает структуру пылегазового потока, в результате
          концентрация измеряемого газового компонента оказывается меньше в измерительном оптическом канале, по
          сравнению с рудничной атмосферой;
        </li>
        <li>
          применение обдува предполагает наличие компрессорных установок с очищенным
          воздухом, далеко не всегда имеющихся в условиях подземных выработок угольных шахт;
        </li>
        <li>
          кроме того, данный способ требует дополнительных энергетических затрат, что приводит
          к удорожанию контроля и уменьшения его технико-экономической эффективности.
        </li>
      </ul>
    </p>
    <p>
      Одним из способов защиты стекол оптических измерителей от запыления является тепловой.
      При размещении нагретого тела в объем, заполненный аэрозолем мелких взвешенных
      частиц, вокруг тела возникает «темная зона», свободная от аэрозоля, толщина которой зависит от разности температур тела и среды, давления газа, размера, формы тела и не зависит от
      его химического состава. Горячее тело отталкивает от себя частицы аэрозоля, это явление
      названо термофорезом и вызвано действием термофоретических сил. Это силы, действующие со стороны
      газообразной среды на находящиеся в ней равномерно нагретые тела
      (в частности частицы аэрозоля).
    </p>
    <p>
      Для оценки влияния эффекта термофореза смотровых стекол оптических измерителей
      составим теоретическую модель воздействия градиента температур на кинетику процесса
      оседания пылевого аэрозоля. При рассмотрении термофоретических сил необходимо различать явления, возникающие при высоком и низком давлении. Под «высоким» и «низким»
      подразумевается давление, при котором средняя длина свободного пробега молекулы газа
      мала или высока по сравнению с размерами частиц. Для промежуточного случая еще не существует
      общепринятой теории. Опыты показали, что термофоретическая сила пропорциональна диаметру частицы и температурному градиенту [5].
      В работе [6] описано измерение
      скорости термофореза взвешенных в воздухе капелек в зависимости от температурного градиента, давления
      воздуха и размера капелек. Полученный экспериментальный материал был
      объяснен на основе формул подвижности частиц. При подстановке в формулу кинетической
      теории газов, получено выражение для расчета скорости термофореза [5]:
    </p>
    <div class="formula-wrap">
      <img src="~/assets/imgs/formulas/ar_3_1.png" alt="" class="formula">
      <span class="formula-num">(1)</span>
    </div>
    <p class="subtitle-wrap">
      где <i><span class="symbol">n</span><sub>t</sub></i>  – скорость частицы [м/с] в поле температурного градиента <i>dT / dx</i> [К/м];
      Р – давление газа [Па]; <i>k<sub>Г</sub></i> и <i>k<sub>Ч</sub></i> – коэффициенты
      теплопроводности газа и вещества частицы [Вт/м<sup>2</sup>К];
      <i>l<sub>t</sub></i> – длина свободного пробега молекулы газа [м]; d – диаметр частицы пыли [м]; Т – абсолютная температура газа [К];
      <i><span class="symbol">m</span><sub>Г</sub></i> – динамическая вязкость воздуха [Па с];
      А , В и С – константы уравнения подвижности газа ( А = 1,25 ; В = 0,44 и С = 1,09).
    </p>
    <p>
      танты уравнения подвижности газа ( А = 1,25 ; В = 0,44 и С = 1,09).
      Устойчивость газодисперсной системы обуславливается степенью дисперсности, концентрацией дисперсной фазы,
      плотностью и структурой дисперсных частиц, влажностью,
      способностью к седиментации и коагуляции. На стабильность системы влияют воздушные
      потоки. Устойчивость газодисперсной системы зависит от скорости осаждения пыли.
      Скорость движения пылинок зависит от сил, действующих в среде, так сопротивление среды
      (<i>F<sub>Г</sub></i>) описывается законом Ньютона:
    </p>
    <div class="formula-wrap">
      <img src="~/assets/imgs/formulas/ar_3_2.png" alt="" class="formula">
      <span class="formula-num">(2)</span>
    </div>
    <p class="subtitle-wrap">
      где S – проекция поперечного сечения пылинки по направлению движения [м<sup>2</sup>];
      <i><span class="symbol">r</span><sub>Г</sub></i> – плотность газовой среды [кг/м<sup>2</sup>];
      <i><span class="symbol">n</span><sub>Ч</sub></i> – скорость движения частиц [м/с];
      K – коэффициент сопротивления, который является функцией критерия Рейнольдса (Re) и определяется опытным
      путем [7]:
    </p>
    <div class="formula-wrap">
      <img src="~/assets/imgs/formulas/ar_3_3.png" alt="" class="formula">
      <span class="formula-num">(3)</span>
    </div>
    <p>
      Критерий Рейнольдса определяет гидравлический режим процесса. При малых значениях критерия Re ( К = 24 /Re )
      в движении участвуют малые частицы, движущиеся с небольшой скоростью. В этом случае режим движения газа относительно
      частицы ламинарный, т.е. скорость газа на поверхности частиц равна скорости частицы. Далее за частицами
      газ движется параллельными струями, которые не смешиваются и не образуют завихрений.
      При больших значениях критерия Re в движении участвуют крупные частицы, движущиеся с
      большей скоростью. При этом движение газа относительно частиц – турбулентное, т.е. пограничный слой
      отрывается от поверхности частиц, происходит перемещение и завихрение
      струй. В данном процессе помимо сил трения (ламинарный режим) участвуют силы инерции,
      где существенное влияние оказывают форма и шероховатость поверхности частиц. При
      ламинарном режиме движения частиц, сопротивление среды описывается зависимостью [7]:
    </p>
    <div class="formula-wrap">
      <img src="~/assets/imgs/formulas/ar_3_4.png" alt="" class="formula">
      <span class="formula-num">(4)</span>
    </div>
    <p>
      Формула (4) является законом Стокса, который широко используется для практических
      расчетов аэрозолей с интервалом дисперсности от 0,1 до 40 мкм. Время, в течение которого
      пылинка может находиться во взвешенном состоянии, определяется, прежде всего, ее размерами и плотностью.
      Витание и осаждение пыли зависит от соотношения силы сопротивления
      среды (<i>F<sub>Г</sub></i>) и силы тяжести, действующей на частицу (<i>F<sub>n</sub></i>) [7]:
    </p>
    <div class="formula-wrap">
      <img src="~/assets/imgs/formulas/ar_3_5.png" alt="" class="formula">
      <span class="formula-num">(5)</span>
    </div>
    <p class="subtitle-wrap">
      где <i><span class="symbol">r</span><sub>Ч</sub></i> – плотность частицы [кг/м<sup>3</sup>];
      V – объем частицы, при рассмотрении выбрана шарообразная форма [м<sup>3</sup>];
      <i>g</i> – ускорение свободного падения [м/с<sup>2</sup>].
    </p>
    <p>
      Если размеры пыли и плотность больше, то частицы падает с возрастающей скоростью,
      так как сопротивление газовой среды ничтожно мало (<i>F<sub>n</sub></i>><i>F<sub>Г</sub></i>) . Если размеры пыли малы, а
      сопротивление газовой среды велико, наступает такой момент, когда <i>F<sub>n</sub></i>=<i>F<sub>Г</sub></i>, то частицы в
      состоянии витания в восходящем потоке воздуха падает с постоянной скоростью <i><span class="symbol">n</span><sub>Ч</sub></i>
      в спокойном воздухе, подчиняясь закону Стокса (4). Для определения данной скорости падения
      приравнивают силу тяжести (<i>F<sub>n</sub></i>) к силе сопротивления среды (<i>F<sub>Г</sub></i>):
    </p>
    <div class="formula-wrap">
      <img src="~/assets/imgs/formulas/ar_3_6.png" alt="" class="formula">
      <span class="formula-num">(6)</span>
    </div>
    <p>
      На рисунке 1 приведена зависимость скорости падения частиц (<i><span class="symbol">n</span><sub>Ч</sub></i>) пыли от скорости
      термофореза (<i><span class="symbol">n</span><sub>t</sub></i>) при изменении дисперсности пыли от 1 до 20 мкм,
      где 1 – величина градиента температур dT/dx=5*10<sup>3</sup>°C/м; 2 – dT/dx=10*10<sup>3</sup>°C/м;
      3 – dT/dx=15*10<sup>3</sup>°C/м.
    </p>
    <div class="chart-wrap">
      <img src="~/assets/imgs/ar_3_1.jpg" alt="" class="chart">
      <p>
        Рисунок 1 – Зависимость скорости падения частиц (<i><span class="symbol">n</span><sub>Ч</sub></i> ) пыли от скорости
        термофореза (<i><span class="symbol">n</span><sub>t</sub></i> ) при изменении дисперсности пыли в диапазоне от 1 до 20 мкм
      </p>
    </div>
    <p>
      Из анализа полученной зависимости (см. рис.1) следует, что при малом диаметре частиц от 1 до 3 мкм
      даже при минимальном значении градиента температур 5*10<sup>3</sup>°С/м скорость теормофореза на порядок и
      более превышает скорость падения частиц. Направления сил термофореза и падения частиц ортогональны, поэтому
      частицы в температурном поле будут
      перемещаться в сторону уменьшения температуры, и практически не будут отседать на
      смотровых стеклах оптоэлектронных компонент измерителя. По мере увеличения диаметра
      частиц пыли, скорости термофореза и падения частиц становятся равными друг другу, угол
      результирующего вектора скорости составляет 45°. При этом, с увеличением градиента температур от 5×103
      до 15*10<sup>3</sup>°С/м наблюдается увеличение радиуса частиц пыли, которые могут
      быть перенесены от смотровых стекол. Так, при градиенте температур 5*10<sup>3</sup>
      °С/м диаметр частиц пыли, которые могут быть перенесены силами термофореза составляет не более
      7,2 мкм, а при повышении градиента до 15*10<sup>3</sup>
      °С/м – увеличивается до 11,8 мкм.
    </p>
    <p>
      При увеличении диаметра частиц пыли начинает доминировать составляющая скорости
      падения частиц пыли, и угол результирующего вектора снижается до нуля. Поэтому данные
      частицы пыли будут оседать на смотровых стеклах оптоэлектронных компонент измерителя.
      Для уменьшения данного влияния необходимо увеличить градиент температур, что приведет
      к большему разогреву чувствительного элемента и повышению энергопотребления измерителя.
      Следовательно, для проверки теоретической модели необходимо провести экспериментальные исследования способа защиты
      стекол от запыления на основе эффекта термофореза,
      что требует разработки макетного образца измерителя с целью определения значение температурного градиента, величина
      которого обеспечит минимальную запыленность смотровых
      стекол оптоэлектронных компонент измерителя. Для этого смотровые стекла покрывают
      тонким прозрачным токопроводящим слоем, к которому подводят электрический ток. Экспериментально установлено [8],
      что при разности температур между поверхностью стекла и
      пылевой средой в 200°С обеспечивается надежная защита от оседания пыли.
    </p>
    <p>
      Для оценки работоспособности предложенного способа защиты стекол от запыленности оптического измерителя
      разработан и создан макетный образец измерителя концентрации метана. Для чего использованы стекла с токопроводящим
      слоем, которые разработаны в Лаборатории масс-спектрометрии кафедры нанофизики Донецкого национального университета.
      Напряжение питания, подводимое к
      токопроводящей поверхности смотрового стекла
      составляет 7,5 В при токе потребления 0,5 А. Значение температуры токопроводящего слоя
      составляло 120 °С, а при удалении на расстояние 5 мм температура снижалась до 66 °С, при
      этом значение градиента температур составило 10,8*10<sup>3</sup>
      °С/м.
    </p>
    <p>
      Проведение экспериментальных исследований разработанного макетного образца измерителя выполнено в
      Лаборатории измерительной техники кафедры электронной техники
      Донецкого национального технического университета. Для проведения лабораторных испытаний создан стенд, где физическая
      среда моделируется пылевой камерой (объем <i>V<sub>K</sub></i> = 0,082 м<sup>3</sup>;
      скорость потока воздуха – не более 5 м/с) [9]. В качестве контрольного измерителя использован сертифицированный прибор ПКА-01 [10].
    </p>
    <p>
      Лабораторные испытания макетного образца измерителя выполнялись в четыре этапа.
      На каждом этапе проводились измерения средних значений выходных напряжений измерительного канала от изменения концентрации
      пыли в лабораторном стенде. Измеряемая концентрация пыли вносилась в лабораторную камеру парциально,
      объем порции соответствовал взвешенной концентрации 0,3 г/м<sup>3</sup>. Исследования проводились в диапазоне изменения
      концентрации пыли от 0 до 3 г/м<sup>3</sup>
      при температуре окружающей среды t=(25±2)°C и относительной влажности воздуха не более 60 %.
      На первом этапе проведено исследование осаждения угольной пыли с защитно-предохранительными средствами,
      т.е. макетный образец оснащен сеткой, которая выполняет детурбулизирующую функцию потока пыли, и включен
      нагрев смотровых стекол оптического измерителя. Для оценки эффективности используемых
      мероприятий проведен второй этап испытаний, при котором выключен нагрев стекол. Аналогичные исследования проведены на
      третьем и четвертом этапах без использования сетки.
      В таблице 1 приведены результаты измерений выходных напряжений измерительного канала
      макетного образца при осаждении пыли на стеклах оптического измерителя с различными
      защитно-предохранительными средствами. Для оценки эффективности использования сетки
      и прогрева стекол измерителя использовалось относительное приращение (<i><span class="symbol">d</span></i> ) остаточных
      выходных напряжений при концентрации пыли С<sub>c</sub>=0 мг/м<sup>3</sup>
      в лабораторной установке:
    </p>
    <div class="formula-wrap">
      <img src="~/assets/imgs/formulas/ar_3_7.png" alt="" class="formula">
    </div>
    <p class="subtitle-wrap">
      где <i><span class="symbol">D</span>U<sub>ВЫХ4</sub></i> – остаточное выходное напряжение измерительного канала при отсутствии
      сетки и выключенном нагреве смотровых стекол [В]; <i><span class="symbol">D</span>U<sub>ВЫХi</sub></i> – остаточные выходные
      напряжения при различных вариантах использования защитно-предохранительных средств.
    </p>
    <p>
      Гистограмма оценки эффективности использования защитно-предохранительных
      средств от запыления оптического измерителя концентрации метана приведена на рисунке 2.
    </p>
    <div class="chart-wrap">
      <p>
        Таблица 1 – Результаты экспериментальных исследований осаждения угольной пыли
        на стеклах оптического измерителя концентрации метана
      </p>
      <img src="~/assets/imgs/ar_3_1_t.jpg" alt="" class="chart">
    </div>
    <div class="chart-wrap">
      <img src="~/assets/imgs/ar_3_2.jpg" alt="" class="chart">
      <p>
        Рисунок 2 – Гистограмма оценки эффективности использования защитнопредохранительных
        средств от запыления оптического измерителя концентрации метана
      </p>
    </div>
    <p>
      На основе анализа полученных оценок эффективности использования термофореза
      смотровых стекол (см. рис. 2) оптического измерителя можно сделать вывод, что использование нагрева
      стекол снижает запыленность оптоэлектронных компонент измерителя в
      4 раза. При использовании в измерителе детурбулизирующей сетки в комплексе с термофорезом
      смотровых стекол степень запыленности оптики снижается практически в 6 раз.
    </p>
    <h3>Выводы</h3>
    <p>
      1. Предложен способ защиты стекол от запыления оптического измерителя концентрации метана в
      угольных шахтах, который основан на явлении термофореза от смотровых
      стекол оптоэлектронных компонент измерителя.
    </p>
    <p>
      2. Для оценки эффективности предложенного способа защиты стекол от запыленности
      разработан и создан макетный образец измерителя концентрации метана. При этом смотровые стекла покрыты тонким
      прозрачным токопроводящим слоем, к которому подводят электрический ток. Напряжение питания, подводимое к
      токопроводящей поверхности смотрового стекла составило 7,5 В при токе потребления 0,5 А. Максимальное значение температуры
      токопроводящего слоя при этом составило 120 °С, а при удалении на расстояние 5 мм температура снижалось до 66 °С,
      при этом значение градиента температур составило 10,8*10<sup>3</sup>°С/м.
    </p>
    <p>
      3. При проведении лабораторных испытаний разработанного макетного образца измерителя концентрации метана выявлено,
      что использование нагрева стекол снижает запыленность оптоэлектронных компонент измерителя в 4 раза.
      При использовании в измерителе детурбулизирующей сетки в комплексе с термофорезом смотровых стекол степень
      запыленности оптики снижается практически в 6 раз, что обеспечило существенное увеличение метрологической надежности
      измерителя и соответственного увеличения
      межповерочного интервала обслуживания измерителя в условиях рудничной атмосферы угольных шахт.
    </p>
    <h3>ЛИТЕРАТУРА</h3>
    <p>
      1.   Пат. 91795 С2. Україна, МПК G 01 N 21/35. Спосіб вимірювання концентрації метану в
      рудниковій атмосфері / О.В. Вовна, А.А. Зорі, В.Д. Коренєв, М.Г. Хламов; Державний
      вищий навчальний заклад «Донецькій національний технічний університет» (Україна). -
      № a200906379; заявл. 19.06.2009; опубл. Бюл. № 8 від 25.08.2010.
    </p>
    <p>
      2.   Пат. 92564 C2. Україна, МПК G 01 N 21/35. Пристрій для вимірювання концентрації метану в рудничній атмосфері / О.В. Вовна, А.А. Зорі, В.Д. Коренєв, М.Г. Хламов; Державний вищий навчальний заклад «Донецькій національний технічний університет»
      (Україна). – № a200909360; заявл. 11.09.2009; опубл. Бюл. № 21 від 10.11.2010.
    </p>
    <p>
      3. Вовна А.В. Компьютеризированная информационно-измерительная система контроля
      концентрации метана в угольных шахтах: дис. … кандидата технических наук: 05.13.05 –
      компьютерные системы и компоненты / Вовна Александр Владимирович. –
      Донецк, 2009. – 200 с.
    </p>
    <p>
      4. Клименко А.П. Непрерывный контроль концентрации пыли / А.П. Клименко,
      В.И. Королев, В.И. Шевцов. – К.: Техника, 1980. – 184 с.
    </p>
    <p>
      5. Грин. Х. Аэрозоли – пыли, дымы и туманы / Х. Грин, В. Лейн. – Пер. с англ. по ред.
      Н.А. Фукса. – изд. 2-е. стер. – Л.: Изд-во «Химия». – 1972. – 428 с.
    </p>
    <p>
      6. Rosenblatt P. Motion of a particle in a temperature gradient / P. Rosenblatt, V. La Mer // Phys.
      Rev., 1946. – v.70, № 5 – 6. – Р. 385 – 395.
    </p>
    <p>
      7. Ушаков К.3. Аэрология горных предприятий: [учебник для вузов] / К.З. Ушаков,
      А.С. Бурчаков и [др.]. – 3-е изд., перераб. и доп. – М.: Недра, 1987. – 421 с.
    </p>
    <p>
      8. Карабегов М.А. Развитие научно-технических основ построения и метрологического
      обеспечения оптических газоанализаторов жидких сред: дис. … доктора технических
      наук: 05.11.13 – приборы и методы контроля природных сред, веществ, материалов и
      изделий / Карабегов Михаил Александрович. – Москва, 2006. – 307 с.
    </p>
    <p>
      9. Соломичев Р.И. Микропроцессорная информационно-измерительная система контроля
      концентрации пыли в атмосфере угольных шахт: дис. … кандидата технических наук: 05.13.05 – компьютерные системы и компоненты / Соломичев Роман Игоревич. –
      Красноармейск, 2014. – 232 с.
    </p>
    <p>
      10. ПКА-01 (ПКА 000.616) [Электронный ресурс]: Производственное объединение «Укрспецкомплект».
      – Режим доступа: <a href="http://ukrsk.com.ua/pka-01.html" target="_blank">http://ukrsk.com.ua/pka-01.html</a>.
      – Дата доступа: февраль 2015. – Загл. с экрана.
    </p>
  </section>
</template>

<script>
export default {
  head () {
    return {
      title: 'А.В. Вовна – Способ защиты стекол от запыления оптического измерителя концентрации метана в угольных шахтах'
    }
  },
  layout: 'article'

}
</script>

<style lang="scss" scoped>
  @import "~/assets/style/media_mixin.scss";
  @import "~/assets/style/var.scss";
  section {
    font-size: 1.7rem;
  }
  h1 {
    font-size: 3rem;
    text-align: center;
    color: $main-blue;
    margin-bottom: 5rem;
  }

  h3 {
    font-size: 2rem;
    color: $main-blue;
    margin-bottom: 2rem;
    margin-top: 3rem;
  }

  p {
    font-size: 1.7rem;
    text-indent: 2.5rem;
    line-height: 150%;
    text-align: justify;

    &+& {
      margin-top: .5rem;
    }
  }

  .subtitle {
    font-weight: 500;
  }

  .subtitle-wrap {
    text-indent: 0;
  }

  .formula {
    height: auto;
    margin: 0 auto;
    width: auto;
    display: block;
    margin-bottom: 1rem;
    max-width: 100%;

    &.f-1 {
      max-width: 100%;
    }

    &.f-1-1 {
      max-width: 30rem;
      margin-left: 0;
      margin-right: 0;
    }

    &.f-1-2 {
      max-width: 45rem;
      margin-left: 0;
      margin-right: 0;
    }

    &.f-2 {
      max-width: 20rem;
    }
    &.f-3 {
      max-width: 40rem;
    }
  }

  .formula-wrap {
    display: flex;
    align-items: center;
    flex-direction: column;
    margin: 3rem 0;

    @include tablet {
      flex-direction: row;
    }
  }

  .formula-num {
    font-size: 1.7rem;
    margin-left: 1rem;
  }

  .symbol {
    font-family:Symbol;
  }

  .annotation {
    margin-bottom: 3rem;
    text-indent: 0;
    margin-left: 2.5rem;
  }

  .desc {
    margin-bottom: 2rem;
  }

  .chart {
    height: auto;
    width: 100%;
    max-width: 36rem;

    @include tablet {
      width: auto;
      max-width: 100%;
    }
  }

  .chart-wrap {
    display: flex;
    flex-direction: column;
    align-items: center;
    margin-bottom: 3rem;

    p {
      text-align: center;
      text-indent: 0;
      margin-top: 1rem;
    }
  }
</style>
