<template>
  <section>
    <h1>Повышение достоверности информации при многокомпонентном контроле шахтной атмосферы</h1>
    <p class="subtitle-wrap">
      <span class="subtitle">Авторы: </span>
      Медведев В. Н., Беляева Е. В., СкляровА. Л., Типоченков С. Ф.
    </p>
    <p class="subtitle-wrap">
      <span class="subtitle">Источник:</span>
      Сборник научных трудов «Способы и средства создания безопасных и здоровых условий труда в угольных шахтах». 2006г. Вып.18, С. 21–129.
    </p>
    <p>
      Одним из направлений повышения безопасности горных работ является совершенствование технических средств контроля состава
      рудничного воздуха. Это нашло свое отражение в ряде программ по охране труда на предприятиях угольной
      промышленности Украины, т.к.  связано с высоким уровнем травматизма горнорабочих по газовому фактору [1].
    </p>
    <p>
      Анализ последних достижений и публикаций показывает, что в настоящее время созданы и интенсивно внедряются
      на шахтах различные газоанализаторы,  в первую очередь,  для  измерения  содержания метана, оксида углерода и кислорода.
      Особое значение отводится стационарным газоанализаторам,  которые объединяются в специальные системы контроля [2].
      Среди таких систем большое внимание на протяжении нескольких лет уделяется унифицированной телекоммуникационной системе
      диспетчерского контроля и автоматизированного управления горными машинами и технологическими комплексами УТАС, в которой
      предусмотрено использование оборудования для определения содержания указанных газов [3]. Кроме  того,  в
      эксплуата-ции находятся стационарные анализаторы метана (АТ1-1, АТ3-1, АТБ) и оксида углерода (ДОУ, «Сигма-СО»),
      которые  совместно  с  аппаратурой контроля скорости воздуха,  стойками  приема  информации
      или аппаратно-программными комплексами КАГИ формируют системы аэрогазового контроля (АГК) [4,5].
    </p>
    <p>
      Несмотря на достигнутые успехи в данном направлении, следует отметить определенные недостатки
      разработанных и эксплуатируемых технических средств контроля.  Так,  стационарные  анализаторы метана, оснащенные
      термокаталитическими чувствительными элементами (сенсорами),  при высоких уровнях содержания метана (более 30% об.)
      могут выдавать ложную информацию и формировать управляющие сигналы,  позволяющие подать электроэнергию на защищаемые объекты.
      Так же может искажаться поступающая от датчиков информация в результате существенного изменения в аварийной обстановке состава
      атмосферы,  т.к.  сенсоры  этих  датчиков  рассчитаны на применение при определенных значениях газовых компонентов.
      Все это и ряд других обстоятельств,  в  определенной мере,  оказывают  отрицательное влияние на развитие аварий или их последствия.
      Следовательно, повышение достоверности информации при газовом мониторинге является актуальной задачей.
    </p>
    <p>
      Цель данной статьи заключается в изложении результатов исследований в области повышения
      эффективности многокомпонентного контроля шахтной атмосферы. Для шахтных газоанализаторов главными критериями эффективности
      их функционирования являются точность проводимых с их помощью измерений и оперативность получения информации или управляющих
      сигналов. На результаты измерений оказывают влияние различные факторы, которые носят  случайный характер и обусловлены
      изменениями состава и параметров рудничной атмосферы,  старением элементов газоанализаторов и т.п. При этом, в
      большинстве случаев, можно пренебречь изменениями динамических свойств сенсоров и считать, что оперативность получения
      информации будет оставаться на заданном уровне. В [6] показано наличие нелинейности выходной характеристики термокаталитических
      сенсоров, приводящей к погрешности измерений и двузначности информации о содержании метана.  Лианеризировать характеристику
      не представляется возможным по причине ее нестабильности за пределами измерительного диапазона,  который  ограничен на уровне
      нескольких объемных долей.  Поэтому  при  разработке шахтных метанометров, использующих термокаталитический принцип преобразования,
      закономерно стремление к исключению выдачи информации при газовых перегрузках путем автоматического блокирования выходного сигнала
      сенсора. В результате изделия существенно усложняются и увеличивается их стоимость.
    </p>
    <p>
      Вторым аспектом, влияющим на достоверность результатов измерений с применением термокаталитических сенсоров,
      является низкая селективность метода преобразования. Наличие  в  анализируемой среде наряду с метаном других
      горючих газов, например, оксида углерода или снижение содержания кислорода приводит к искажению полученных результатов
      измерений содержания метана. Для комплексного решения рассмотренных задач были проведены экспериментальные исследования
      с применением технических средств системы УТАС: контроллера ТХ 9042, блока питания ТХ 6622, датчиков  ТХ 3261, ТХ 3264,
      ТХ 3241 и оборудования Испытательного центра МакНИИ:  газоанализаторов ГИАМ-14  и  испытательной  камеры. Изделия размещались
      и соединялись согласно схеме, представленной на рисунке.
    </p>
    <p>
      Данные,  характеризующие используемую при исследованиях газоаналитическую технику, приведены в табл. 1. Работа проводилась в
      следующей последовательности. В испытательную камеру помещались датчики, предварительно настроенные  по образцовым  газовым
      смесям. Питание датчиков осуществлялось от источника ТХ 6622. Из баллона высокого давления с объемной
      долей метана около 100%  через  редуктор  порциями  подавался газ, который перемешивался в испытательной камере с
      помощью вентилятора.  Полученная метано-воздушная смесь контролировалась двумя газоанализаторами ГИАМ-14.  Поступающая от
      датчиков информация фиксировалась контроллером ТХ 9042.
    </p>
    <p>
      Исследования позволили установить,  что при  любых  значениях содержания метана датчик ТХ 3241  остается
      индифферентным к сформированной газовоздушной смеси и не изменяет своих показаний. Результаты измерений,
      полученные  от  датчиков ТХ 3261  и ТХ 3264, зафиксированные контроллером, представлены в табл. 2. Анализ полученных данных
      показал следующее.
      <ol>
        <li>Датчик ТХ 3261  может обеспечивать контроль содержания метана в пределах диапазона измерения.</li>
        <li>
          Работа датчика ТХ 3261 в диапазоне от 4,2 до 10% об. СН4 приводит к индикации на контроллере
          текстовой информации «Оver rang» (выше диапазона).
        </li>
        <li>
          При газовых перегрузках по метану в пределах от 10 до 30% об. СН4 датчик ТХ 3261
          выдает сигнал о якобы имеющемся повреждении («Fault»).
        </li>
        <li>
          При газовых перегрузках от 30% об. и вплоть до 100% об. СН4 проявляется неоднозначность показаний,  т.е.
          датчик  ТХ 3261  выдает ложные показания об уровне содержания метана.
        </li>
        <li>Датчик ТХ 3264 имеет близкую к линейной зависимость выходного сигнала от содержания метана в анализируемой атмосфере.</li>
      </ol>
    </p>
    <div class="chart-wrap">
      <img src="~/assets/imgs/ar_4_1.jpg" alt="" class="chart">
      <p>
        Рисунок 1 – Функциональная схема включения оборудования при исследованиях реакции датчиков ТХ 3261,
        ТХ 3264, ТХ 3241 на содержание метана в анализируемой среде
      </p>
    </div>
    <p>
      Следовательно, при  одновременном измерении  содержания метана и кислорода появляется возможность исключить
      появление ложной информации, которая поступает от термокаталитического датчика метана  ТХ 3261, путем  его
      отключения при высоких  уровнях содержания метана,  значительно снижающих содержание кислорода  в  анализируемой среде.
      Отключение датчика ТХ 3261 может производиться как по его выходному сигналу,  превышающему  диапазон  измерения,
      так и по сигналу датчика кислорода ТХ 3264,  значение которого снизится до определенного уровня.  Повторное включение датчика
      ТХ 3261  должно происходить только на основе информации,  поступающей от датчика ТХ 3264, когда содержание кислорода в
      атмосфере станет достаточным для нормальной работы термокаталитического датчика.
    </p>
    <div class="chart-wrap">
      <p>
        Таблица 1 – Основные технические характеристики газоанализаторов
      </p>
      <img src="~/assets/imgs/ar_4_2.jpg" alt="" class="chart">
    </div>
    <p>
      Отключение датчика ТХ 3261 по его выходному сигналу приведет к необходимости введения определенных временных
      задержек для повторного включения.  Обусловлено это погрешностями измерения содержания кислорода датчиком  ТХ 3264.
      Так, после отключения датчика ТХ 3261, в результате превышения верхнего значения диапазона измерения, может сразу поступить
      сигнал на его включение из-за того, что датчик ТХ 3263 выдаст контроллеру информацию о наличии в атмосфере кислорода,
      уровень которого будет достаточным для измерения содержания метана в рабочем диапазоне датчика ТХ 3261. Определить
      значение временной задержки можно на основе статистических данных о длительности превышения диапазона измерения.
      При  этом всегда будет существовать вероятность «простоя»  датчика  при  наличии в контролируемой атмосфере уровня
      содержания метана ниже верхнего значения диапазона измерения. Если поставить условие, что датчик ТХ 3261
      должен всегда находиться во включенном состоянии, то следует ориентироваться только на информацию, поступающую
      от датчика кислорода. Уставки срабатывания датчика ТХ 3264  для отключения (включения)  датчика  ТХ 3261 были
      определены исходя из максимальных погрешностей, которые могут встречаться при контроле параметров рудничной атмосферы
      указанными датчиками. Они  составили 19,00%  об. О2 для выключения и 19,35% об. О2 для включения датчика метана ТХ 3261
      датчиком кислорода ТХ 3264.
    </p>
    <div class="chart-wrap">
      <p>
        Таблица 2 – Реакция датчиков ТХ 3261 и ТХ 3264 на объемные доли метана, содержащиеся в газовоздушной смеси
      </p>
      <img src="~/assets/imgs/ar_4_3.jpg" alt="" class="chart">
    </div>
    <p>
      Следует отметить, что аналогичным образом можно исключить неоднозначность
      представления информации о содержании метана в анализаторах серии АТ (АТ1-1, АТ3-1  АТБ) или  в  других
      аналогичных изделиях,  где применяются термокаталитические сенсоры без специальных элементов защиты от двузначности.
      Как уже отмечалось,  термокаталитические  сенсоры  реагируют на все горючие газы и пары. Оксид углерода относится к
      этим газам. Поэтому при его наличии в анализируемой атмосфере показания датчиков метана могут быть искажены.
      Проведенные исследования показали,  что  датчики  ТХ 3241  не реагируют на изменение концентрации метана и кислорода.
      Это приводит к мысли о целесообразности при многокомпонентном контроле вводить автоматически поправки в результаты измерений.
      Так,  показания датчика метана должны быть скорректированы с учетом выходного сигнала датчика оксида углерода или других
      датчиков горючих газов. Применяя датчики температуры, влажности, атмосферного давления и т.п., можно аналогичным образом
      компенсировать многие погрешности, влияющие на результаты измерений при условии компактного размещения сенсоров,формирующих
      исходную  информацию. В этой связи,  с позиции технической реализации,  многокомпонентный контроль в перспективе должен
      осуществляться путем применения измерительных станций,  которые на основе комплексной обработки большого объема различной
      информации о составе и параметрах рудничной атмосферы смогут выдавать данные с существенно меньшими погрешностями в
      сравнении с отдельным изделием,  измеряющим  сугубо один показатель.  Создание измерительных станций потребует решения
      многих вопросов, но уже в ближайшее время, путем объединения различных датчиков и усложнения алгоритмов обработки
      поступающей в контроллеры информации, можно значительно повысить эффективность многокомпонентного контроля рудничной
      атмосферы и исключить определенные недостатки датчиков,  как  это показано на примере ТХ 3261.
    </p>
    <h3>ВЫВОДЫ</h3>
    <ol>
      <li>
        При многокомпонентном контроле шахтной атмосферы целесообразно осуществлять комплексную обработку информации,
        поступающей от сенсоров.
        Это позволяет снизить погрешности результатов измерений и исключить неоднозначность представления данных о газовой обстановке.
      </li>
      <li>
        Для повышения достоверности информации следует размещать сенсоры,  контролирующие состав и параметры шахтной атмосферы,
        в зоне с однотипными характеристиками окружающей среды.
      </li>
    </ol>
    <h3>ЛИТЕРАТУРА</h3>
    <p>
      1.   Расследование и предотвращение аварий на угольных шахтах. Т.1 / [Брюханов А. М., Бережинский В. И., Бусыгин К. К. и др.];
      под  общ. ред. А. М. Брюханова. – Донецк: НордПресс, 2004. – 548 с.
    </p>
    <p>
      2.   Карпов Е.  Ф.  Автоматическая газовая защита и контроль рудничной атмосферы /  Карпов Е.  Ф.,  Биренберг И.  Э.,
      Басовский Б. И. – М.: Недра, 1984. – 285 с.
    </p>
    <p>
      3. Унифицированная телекоммуникационная система УТАС –новый шаг в обеспечении безопасных условий труда в
      угольных шахтах /  А.  М.  Брюханов,  В.  П.  Коптиков, Ю. А. Иванов [ и др.] // Способы и средства создания
      безопасных и здоровых условий труда в угольных шахтах:
      сб. науч.  тр. / МакНИИ. – Макеевка-Донбасс, 2005. – С.322 – 333.
    </p>
    <p>
      4.Временное руководство по оборудованию и эксплуатации систем аэрогазового контроля в угольных шахтах (АГК):
      Утв. Минуглепромом СССР 18.12.91. – МакНИИ., 1991. –  70
      с. – (Нормативный  документ  МУП СССР).
    </p>
    <p>
      5. Правила безпеки у вугільних шахтах: НПАОП 10.0-1.01-05. –  К.:Відлуння, 2005. – 398 с. – (Нормативно-правовий   акт  з  охорони працi).
    </p>
    <p>
      6. Медведев В. Н. Математическая модель формирования  выходных сигналов термокаталитических датчиков
      метана / В. Н. Медведев  // Способы и средства создания безопасных и здоровых условий труда в угольных шахтах: сб. науч. тр. /
      МакНИИ. –  Макеевка-Донбасс.– 2006. –  Вып. 18. – С. 121–129.
    </p>
  </section>
</template>

<script>
export default {
  head () {
    return {
      title: 'Медведев В. Н., Беляева Е. В., СкляровА. Л., Типоченков С. Ф – Повышение достоверности информации при многокомпонентном контроле шахтной атмосферы'
    }
  },
  layout: 'article'

}
</script>

<style lang="scss" scoped>
  @import "~/assets/style/media_mixin.scss";
  @import "~/assets/style/var.scss";
  section {
    font-size: 1.7rem;
  }
  h1 {
    font-size: 3rem;
    text-align: center;
    color: $main-blue;
    margin-bottom: 5rem;
  }

  h3 {
    font-size: 2rem;
    color: $main-blue;
    margin-bottom: 2rem;
    margin-top: 3rem;
  }

  p {
    font-size: 1.7rem;
    text-indent: 2.5rem;
    line-height: 150%;
    text-align: justify;

    &+& {
      margin-top: .5rem;
    }
  }

  .subtitle {
    font-weight: 500;
  }

  .subtitle-wrap {
    text-indent: 0;
  }

  .formula {
    height: auto;
    margin: 0 auto;
    width: auto;
    display: block;
    margin-bottom: 1rem;
    max-width: 100%;

    &.f-1 {
      max-width: 100%;
    }

    &.f-1-1 {
      max-width: 30rem;
      margin-left: 0;
      margin-right: 0;
    }

    &.f-1-2 {
      max-width: 45rem;
      margin-left: 0;
      margin-right: 0;
    }

    &.f-2 {
      max-width: 20rem;
    }
    &.f-3 {
      max-width: 40rem;
    }
  }

  .formula-wrap {
    display: flex;
    align-items: center;
    flex-direction: column;
    margin: 3rem 0;

    @include tablet {
      flex-direction: row;
    }
  }

  .formula-num {
    font-size: 1.7rem;
    margin-left: 1rem;
  }

  .symbol {
    font-family:Symbol;
  }

  .annotation {
    margin-bottom: 3rem;
    text-indent: 0;
    margin-left: 2.5rem;
  }

  .desc {
    margin-bottom: 2rem;
  }

  .chart {
    height: auto;
    width: 100%;
    max-width: 36rem;

    @include tablet {
      width: auto;
      max-width: 100%;
    }
  }

  .chart-wrap {
    display: flex;
    flex-direction: column;
    align-items: center;
    margin-bottom: 3rem;

    p {
      text-align: center;
      text-indent: 0;
      margin-top: 1rem;
    }
  }
</style>
