<template>
  <section>
    <h1>Бюджетный усилитель с фотодиодом для обнаружения альфа-частиц</h1>
    <p class="subtitle-wrap">
      <span class="subtitle">Авторы: </span>
      Cláudio&nbsp;Domienikan, Priscila&nbsp;Costa, Frederico&nbsp;A.&nbsp;Genezini, Guilherme&nbsp;S&nbsp;Zahn
    </p>
    <p class="subtitle-wrap">
      <span class="subtitle">Автор перевода: </span>
      Савельев&nbsp;Д.А.
    </p>
    <p class="subtitle-wrap">
      <span class="subtitle">Источник:</span>
      <a href="https://inis.iaea.org/collection/NCLCollectionStore/_Public/49/018/49018135.pdf" target="_blank">
        International Nuclear Information System (INIS)
      </a>
    </p>
    <h3>Аннотация</h3>
    <p class="annotation">
      <span class="subtitle">
        Cláudio&nbsp;Domienikan, Priscila&nbsp;Costa, Frederico&nbsp;A.&nbsp;Genezini, Guilherme&nbsp;S&nbsp;Zahn.
        Бюджетный усилитель с фотодиодом для обнаружения альфа-частиц.
      </span>
      <i>
        Представлен недорогой усилитель для фотодиода Hamamatsu S3590-09 PIN, который будет использоваться для
        обнаружения альфа-частиц. Этот усилитель состоит из двух цепей: импульсного предусилителя и формирователя.
        PIN-фотодиод с обратным смещением подключен ко входу
        предварительного усилителя сигнала. Альфа-частицы, попадающие на фотодиод, генерируют небольшой ток.
        Интегрирующая схема малошумящего предусилителя преобразует импульс
        тока в импульс напряжения с амплитудой, пропорциональной заряду, переносимому импульсом тока.
        Формирователь состоит из дифференциатора и интегратора и отвечает за фильтрацию и дальнейшее усиление
        сигнала, генерирующий NIM-совместимый (NIM - Nuclear Instrumentation Module - Модуль ядерного приборостроения)
        импульс энергии. Производительность данного фотодиодного усилителя успешно испытана с использованием радиоактивного
        источника 243Am. Недорогой фотодиодный усилитель был спроектирован и построен
        в IPEN - CNEN / SP с использованием национальных компонентов и опыта.
      </i>
    </p>
    <h3>1 ВВЕДЕНИЕ</h3>
    <p>
      Кремниевые PIN-фотодиоды обеспечивают надежное и компактное решение для
      радиационного контроля. Альфа, бета, гамма и рентгеновское излучение могут
      быть обнаружены либо непосредственно через поглощение в кристаллической решетке [1]
      или косвенно через измерение люминесцентного излучения сцинтилляционного кристалла [2].
    </p>
    <p>
      Есть несколько работ, в которых сообщается о применении
      PIN-фотодиодов для прямого обнаружения излучение с использованием
      дорогого малошумящего зарядного предусилителя [3–6]. В некоторых случаях
      вход окна на некоторых неинкапсулированных PIN-фотодиодах достаточно мал,
      чтобы позволить альфа-частицам проникнуть в область истощения, и некоторые модели с
      малой утечкой показали хорошую разрешающую способность, достаточную для подключения
      к недорогим предусилителям для альфа-излучения
      или нейтронного излучение (с использованием борного преобразователя).
    </p>
    <p>
      При разработке нейтронного детектора с использованием борного преобразователя и
      PIN-фотодиода [7], мы столкнулись с необходимостью недорогого портативного и
      универсального усилителя, который мог бы легко встраиваться в детектор. Как и
      в таком устройстве, детектор будет использоваться в качестве счетчика частиц,
      наиболее важной особенностью усилителя является не разрешающая способность,
      а шумоподавление - возможность выступать в качестве спектрометра будет полезна
      только во время этапа разработки,
      или для тонкой настройки усиления и дискриминации устройства.
    </p>
    <p>
      Встроенная система сбора данных, представленная в этой работе,
      состоит из Si-PIN-фотодиода с большой активной областью,
      предварительного усилителя заряда и формирователя.
      Эта схема может работать как альфа-спектрометр или как альфа-счетчик, в зависимости
      от электронной настройки,
      основанной на энергетическом окне альфа-излучения.
    </p>
    <h3>2 PIN-ФОТОДИОДЫ</h3>
    <p>
      Типичная PIN-фотодиодная структура показана на рис. 1.
      Она состоит из прозрачного контактного слоя р-типа с высокой степенью легирования
      сверху и слоя n-типа снизу. Наиболее важной частью PIN-фотодиода для этого устройства
      является толстый внутренний (нелегированный) слой между слоями n и p. Эта структура
      необходима для одного основного требования. Когда заряженные частицы, такие как
      альфа-лучи, ударяются о поглощающий слой PIN-фотодиода, их энергия рассеивается вдоль
      линейной дорожки, длина которой определяется типом и энергией падающих заряженных
      частиц, и электронно-дырочные пары генерируются посредством Кулоновского взаимодействия
      заряженной частицы с электронами. Количество генерируемых электронно-дырочных пар зависит
      не от типа заряженной частицы, а скорее от потери энергии (при 300 К одна
      электронно-дырочная пара генерируется в среднем на каждые 3,62 эВ).
      Поэтому потерю энергии можно оценить путем определения величины этого заряда.
    </p>
    <div class="chart-wrap">
      <img src="~/assets/imgs/ar_5_1.png" alt="" class="chart">
      <p>
        Рисунок 1 – Базовая схема структуры PIN-фотодиодов
      </p>
    </div>
    <p>
      Электронно-дырочные пары расходятся, и когда неосновные носители достигают
      соединения между двумя слоями, они ускоряются электрическим полем. Если две
      стороны электрически соединены, через соединение протекает ток. Если созданные
      миноритарные несущие этой области рекомбинируют с насыпными носителями этой области
      до достижения поля соединения,
      несущие теряются, и внешний ток не протекает.
    </p>
    <p>
      Один из наиболее важных аспектов в устройствах обнаружения связан с
      шумовыми характеристиками фотодиода. Два параметра имеют основной вклад в
      уровень шума: ток утечки и емкость фотодиода. Наличие собственного слоя снижает
      как ток утечки, так и емкость соединения, поэтому можно добиться хорошей разрешающей
      способности даже при комнатной температуре. Итак, основными характеристиками
      PIN-фотодиода, использованного в данной работе, являются: большая активная площадь
      (10 мм х 10 мм), низкая емкость, удобство использования со
      сцинтилляторами и самопроизвольное обнаружение излучения.
    </p>
    <h3>3 PIN-ФОТОДИОДНЫ УСИЛИТЕЛЬ</h3>
    <p>
      Схема усилителя PIN фотодиодов может быть разделена на две основные части:
      схема предусилителя и формирователь (рисунок 2). Предусилитель является первой
      ступенью фотодиодного усилителя, который является наиболее важным. Была использована
      интегрирующая схема, которая преобразует импульс тока из фотодиода PIN-кода Hamamatsu
      S3590-09 [8] в импульс напряжения с амплитудой, пропорциональной заряду, переносимому
      импульсом тока. Этот импульс усиливается двумя очень распространенными транзисторами
      BJT-NPN (BC547) в каскаде. Эти транзисторы, однако, имеют хорошую частотную
      характеристику, отношение сигнал / шум и линейность.
    </p>
    <div class="chart-wrap">
      <img src="~/assets/imgs/ar_5_2.png" alt="" class="chart">
      <p>
        Рисунок 2 – Схема разработанного фотодиодного усилителя
      </p>
    </div>
    <p>
      Амплитуда сигнала напряжения на выходе предусилителя составляет всего
      около нескольких десятков мВ, поэтому необходимо дополнительное усиление
      и фильтрация шума. Это выполняется схемой, называемой «формирователь».
      Каждый сигнал имеет свой естественный спектр в частотной области, и к нему
      добавляется шумовой спектр. Когда используются фильтры, можно улучшить
      уровень сигнал-шум. Для каждой ступени использовались дифференциатор и
      интегратор (фильтры CR-RC) с одинаковыми постоянными времени формирования
      (≈ 0,1 с). Транзистор 2N2222 (драйвер тока) снижает выходное сопротивление
      цепи. Для достижения оптимальных шумовых характеристик системы мы экспериментально
      исследовали зависимость постоянной времени формирования. Выходные сигналы (A и B),
      полученные после каждого каскада, можно увидеть на рисунке 3, где можно сделать вывод,
      что общее усиление каскада усилителя формирования составляет около 80-ти.
      Выходной сигнал (B) может быть подан непосредственно на многоканальный анализатор,
      благодаря чему система работает как спектрометр. Чтобы использовать систему в
      качестве счетчика импульсов, цель этой работы, уровень дискриминации выходного
      сигнала должен быть установлен в потенциометре
      1 кОм перед подачей на модуль подсчета импульсов.
    </p>
    <p>
      Весь прототип (включая фотодиод) был собран внутри черного металлического корпуса,
      чтобы избежать влияния окружающего света и защитить систему
      от электрических помех и альфа-частиц окружающей среды.
    </p>
    <p>
      За исключением фотодиода, все электронные компоненты, используемые в этой схеме,
      были легко приобретены в магазинах.
      Общая стоимость прототипа, кроме фотодиода, была менее 15 долларов США.
    </p>
    <div class="chart-wrap">
      <img src="~/assets/imgs/ar_5_3.jpg" alt="" class="chart">
      <p>
        Рисунок 3 – Выходной импульс предварительного усилителя (A) и коррелированный выходной импульс (B) от схемы усилителя фотодиода
      </p>
    </div>
    <h3>4 ЭКСПЕРИМЕНТАЛЬНАЯ ПРОВЕРКА</h3>
    <p>
      Некалиброванный альфа-источник ~ 1 кБк 243Am (наиболее интенсивные энергии альфа-частиц:
      5,32 МэВ - 11% - и 5,36 МэВ - 87% [9]), нанесенный на диск из нержавеющей стали,
      был помещен на расстоянии 5,0 мм от фотодиода внутри корпуса системы, при комнатном
      давлении и температуре. Выходной импульс от усилителя, описанного в этой статье,
      подавался непосредственно в многоканальный анализатор ORTEC Spectrum Ace
      без какого-либо дополнительного усиления или обработки.
    </p>
    <p>
      Чтобы проверить работу усилителя, эксперимент длился 54000 секунд
      (время работы в реальном времени), и полученный спектр представлен на рисунке 4.
      Наблюдаемое время простоя системы составило 0,07%. Полученный спектр был проанализирован
      с использованием программного обеспечения IDEFIX [10], в котором используется модель
      Гаусса с экспоненциальным хвостом и функцией ошибки для подгонки к каждому пику; была
      выбрана группа из двух пиков, относящихся к наиболее интенсивным альфа-излучениям от
      243 Ам, а результирующая полная ширина на половине максимума (FWHM) каждого из пиков
      была менее 6%, тогда как в более дорогих системах она может быть величиной 1-2%.
      Полученные результаты, однако, идеально подходят для требований нейтронного счетчика,
      основанного на обнаружении альфа-частиц в ядерной реакции 10B (n, α) 7 Li [7],
      так как в этом случае PIN-фотодиод будет работать в основном как счетчик альфа-частиц -
      он также может быть полезен для других менее требовательных устройств обнаружения
      альфа-частиц. Поскольку предлагаемое устройство не требует отклика энергии, калибровка
      энергии не была выполнена -
      при необходимости она должна быть выполнена на будущей стадии.
    </p>
    <p>
      Чтобы проверить подавление системы, было выполнено второе обнаружение без
      присутствия радиоактивного источника в течении 72000с
      (время работы в реальном времени). В полученном спектре не
      было никаких подсчетов, указывающих на отличное выделение альфа-частиц от фоновых
      β-частиц и рентгеновских и γ-лучей. Это также говорит о том, что
      порог шума системы, если этого требует другое устройство, может быть уменьшен
      без ущерба для производительности.
    </p>
    <div class="chart-wrap">
      <img src="~/assets/imgs/ar_5_4.jpg" alt="" class="chart">
      <p>
        Рисунок 4 – Экспериментальный спектр альфа-излучения 243Am, полученный с использованием фотодиода S3590-09, подключенного к предлагаемой системе усиления. Точки представляют экспериментальные данные, а линии соответствуют подгонке к паре гауссовых пиков.
      </p>
    </div>
    <h3>ВЫВОДЫ</h3>
    <p>
      Была разработана система, состоящая из предусилителя и формирующего
      усилителя для использования с фотодиодом S3590-09 PIN с целью создания
      недорогой системы, которая может быть применена в альфа- или нейтронной системе
      обнаружения (с использованием соответствующего борного преобразователя).
      Производительность системы для обнаружения альфа-частиц была определена с
      использованием альфа-источника 243Am, что позволило получить энергетическое
      разрешение менее 6%. Кроме того, измерение фона не привело ни к каким подсчетам,
      показывая, что система отлично подходит для предполагаемого применения в качестве
      счетчика частиц. Весь альфа-спектрометр (исключая фотодиод) был собран менее чем за
      15 долларов США с использованием только общедоступных компонентов.
    </p>
    <h3>ЛИТЕРАТУРА</h3>
    <p class="left">
      1.  C.C.&nbsp;Bueno, J.A.C.&nbsp;Gonçalves, M.D.&nbsp;de&nbsp;S.&nbsp;Santos, “The performance of low-cost
      commercial photodiodes for charged particle and X-ray spectrometry”, Nuclear
      Instruments and Methods in Physics Research A, 371, pp.460-464 (1996).
    </p>
    <p class="left">
      2.   R.L.&nbsp;Owen, J.M.&nbsp;Holton, C.&nbsp;Schulze-Briese, E.F.&nbsp;Garman. “Determination of X-ray flux
      using silicon pin diodes”, J Synchrotron Radiat., 16(Pt 2), pp 143-151 (2009).
    </p>
    <p class="left">
      3. C.N.P&nbsp;Oliveira, H.J.&nbsp;Khoury, E.J.P.&nbsp;Santos, “PiN photodiode performance comparison
      for dosimetry in radiology applications”, Physica Medica, 32 pp. 1495-1501 (2016).
    </p>
    <p class="left">
      4.P.H.&nbsp;Gooda, W.B.&nbsp;Gilboy, “High resolution alpha spectroscopy with low cost
      photodiodes”, Nuclear Instruments and Methods in Physics Research A, 255, pp.222-224
      (1987).
    </p>
    <p class="left">
      5. R.&nbsp;Nowotny, W.L.&nbsp;Reiter, “The use of silicon pin-photodiodes as a low-energy
      photonspectrometer”, Nuclear Instruments and Methods in Physics Research A, 147,
      pp.477-480 (1977).
    </p>
    <p class="left">
      6. D.&nbsp;Renker, E.&nbsp;Lorenz, “Advances in solid state photon detectors”, Journal of
      Instrumentation, 4, P04004 (2009).
    </p>
    <p class="left">
      7. P.&nbsp;Costa, M.P.&nbsp;Raele, H.&nbsp;Yoriyaz, P.T.D.&nbsp;Siqueira, G.S.&nbsp;Zahn, F.A.&nbsp;Genezini, “Boron
      Film Thickness Determination To Develop A Low Cost Neutron Using Monte Carlo
      Method,” Proceedings of the 2015 International Nuclear Atlantic Conference, São Paulo,
      October 4-9 (2015).
    </p>
    <p class="left">
      8. <q>SI PIN Photodiode</q>, <a
        href="https://www.hamamatsu.com/resources/pdf/ssd/s3590-08_etc_kpin1052e.pdf"
        target="_blank"
      >https://www.hamamatsu.com/resources/pdf/ssd/s3590-
        08_etc_kpin1052e.pdf</a> (2012).
    </p>
    <p class="left">
      9. <q>Table de Radionocléides</q>, http://www.nucleide.org/DDEP_WG/DDEPdata.htm (2017).
    </p>
    <p class="left">
      10. P.&nbsp;Gouffon, <q>Manual do programa IDEFIX</q>, USP, São Paulo, 1987.
    </p>
  </section>
</template>

<script>
export default {
  head () {
    return {
      title: 'Cláudio Domienikan, Priscila Costa, Frederico A. Genezini, Guilherme S. Zahn – Бюджетный усилитель с фотодиодом для обнаружения альфа-частиц'
    }
  },
  layout: 'article'

}
</script>

<style lang="scss" scoped>
  @import "~/assets/style/media_mixin.scss";
  @import "~/assets/style/var.scss";
  section {
    font-size: 1.7rem;
  }
  h1 {
    font-size: 3rem;
    text-align: center;
    color: $main-blue;
    margin-bottom: 5rem;
  }

  h3 {
    font-size: 2rem;
    color: $main-blue;
    margin-bottom: 2rem;
    margin-top: 3rem;
  }

  p {
    font-size: 1.7rem;
    text-indent: 2.5rem;
    line-height: 150%;
    text-align: left;

    @include tablet {
      text-align: justify;
    }

    &+& {
      margin-top: .5rem;
    }
  }

  .subtitle {
    font-weight: 500;
  }

  .subtitle-wrap {
    text-indent: 0;
  }

  .formula {
    height: auto;
    margin: 0 auto;
    width: auto;
    display: block;
    margin-bottom: 1rem;
    max-width: 100%;

    &.f-1 {
      max-width: 100%;
    }

    &.f-1-1 {
      max-width: 30rem;
      margin-left: 0;
      margin-right: 0;
    }

    &.f-1-2 {
      max-width: 45rem;
      margin-left: 0;
      margin-right: 0;
    }

    &.f-2 {
      max-width: 20rem;
    }
    &.f-3 {
      max-width: 40rem;
    }
  }

  .formula-wrap {
    display: flex;
    align-items: center;
    flex-direction: column;
    margin: 3rem 0;

    @include tablet {
      flex-direction: row;
    }
  }

  .formula-num {
    font-size: 1.7rem;
    margin-left: 1rem;
  }

  .symbol {
    font-family:Symbol;
  }

  .annotation {
    margin-bottom: 3rem;
    text-indent: 0;
    margin-left: 2.5rem;
  }

  .desc {
    margin-bottom: 2rem;
  }

  .chart {
    height: auto;
    width: 100%;
    max-width: 36rem;

    @include tablet {
      width: auto;
      max-width: 100%;
    }
  }

  .chart-wrap {
    display: flex;
    flex-direction: column;
    align-items: center;
    margin-bottom: 3rem;

    p {
      text-align: center;
      text-indent: 0;
      margin-top: 1rem;
    }
  }
</style>
