{
  "titleHead": "– Dmitry Savaliev – Research and development of methods and means of improving the metrological reliability of an optical absorption mine methanometer",
  "resume": {
    "title": "Brief resume",
    "text": "  <p>Name</p><span>Dmitry Saveliev</span>    <p>Date of birth</p><span>Oct 16, 1995</span>    <p>Place of birth</p><span>Donetsk</span>    <p>Schools</p><span>2003&ndash;2011 Donetsk city Lyceum №30</span>    <p>Universities</p><span>Bachelor &ndash; Donetsk National Technical University (2015&ndash;2018); <br>Specialty &ndash; <q>Electronics and nanoelectronics</q>;<br>Magister degree &ndash; Donetsk National Technical University (2018&ndash;2020);<br>Specialty &ndash; <q>Electronics and nanoelectronics</q>;</span>    <p>Average score</p><span>4.8 out of 5 points</span>    <p>Languages</p><span>Russian &ndash; native;<br>Ukrainian &ndash; perfectly;<br>English &ndash; intermediate.</span>    <p>Personal achievements</p><span>Environmental Conference &ndash; First Place for Best Presentation. <br>The Olympics in Electronics is one of the prize places.</span>    <p>Hobbies and interests</p><span>Games: computer; <br> Music: rock; <br>Films, TV shows: detective story, science fiction, thriller, noir, fantasy, drama, historical.</span>    <p>Personal qualities</p><span>Responsibility, learning ability, curiosity, sense of purpose.</span>    <p>Professional and computer skills</p><span>Operating systems: Windows, Android, Ubuntu;<br>Applications: Microsoft Office, Adobe Photoshop, Adobe Illustrator, KOMPAS 3D, MathCad, LabView, Proteus, Matlab, DipTrace, Multisim, 3D Max;<br>Programming languages: JavaScript, C, C++;<br>Development environments: Visual Studio Code, ArduinoIDE, Delphi.</span>    <p>Professional experience</p><span>Internship: SE MACHINE-BUILDING PLANT <q>ITRAS</q>;<br>Undergraduate practice: SE MACHINE-BUILDING PLANT <q>ITRAS</q>.</span>    <p>Future plans</p><span>Professional and career progression.</span>    <p>Contact information</p><a href='https://www.linkedin.com/in/dmitry-saveliev-125394197/' target='_blank'>Linkedin</<a>"
  },
  "abstract": {
    "picture": "Figure",
    "where": "where",
    "title": "Abstract",
    "titles": {
      "t1": "Contents",
      "t2": "Relevance",
      "t3": "Purpose and objectives of the study, planned results",
      "t4": "General structural diagram of the optical gas analyzer",
      "t5": "Review of existing methods, tools and systems for measuring methane concentration",
      "t6": "Main perturbating factors of coal mine atmosphere",
      "t7": "Development of an optical scheme for a methane concentration meter",
      "t8": "Conclusion",
      "t9": "List of sources"
    },
    "p1": "<p>   The coal industry has a significant role in electricity production – the fuel balance of the state depends on it. Coal plays an important role in the chemical and metallurgical industries. It is used in the production of calcium carbide, electrocorundum, synthetic liquid fuel, cast iron, steel, carbonaceous filler for electrode products, lime, cement, brick, synthetic rubber, plastics, etc.  </p>  <p>    Coal is extracted by open mine method and closed mine method [<a href='#literature'>7</a>].    The open method is used at the depth of coal deposits up to 100 meters. The topsoil is removed. Then rock is crushed with the help of bulldozers, water cannons, excavators, crusher and coal drilling and blasting. This process covers a significant area, is economical, relatively safe, has a high production rate, but causes appreciable damage to the environment, and the coal produced by this process contains many impurities. </p>  <p>    The closed method is used when the coal lies at a sufficiently deep depth. Vertical or horizontal bores are laid to the place of location, from which the shaft is formed. Mining of coal by closed method can be carried out by means of elk or chamber-pillar method (lava is a long bottomhole). Coal is chopped in bottoms by means of extraction combine. Coal is sent to the surface by means of a conveyor. In this method, almost all coal is extracted from the formation. The chamber-pillar method uses poles and horizontal passages between them. This method is used in shallow coal formation.  </p>  <p>    With the closed method, coal is produced of high quality, less damage to the environment, but has high danger and requires large financial investments.  </p>  <p>    The problem with closed coal mining is that there is a risk of methane explosion in coal mining. In order to prevent this, a system of aerogas control is used in the mines, which performs automatic blackout of electricity at the section of the mine where methane concentration has exceeded the norm. </p>  <p>    According to the standards [<a href='#literature'>5</a>], the response time of the non-active sensor – 15 s, fast-acting (at methane concentration of 2%, at growth speed of 0.5% in 1 s) – 0.8 s.  </p>  <p>    Existing stationary methane concentration controls have a common disadvantage – low speed due to the considerable inertia of methane concentration determination. </p>  <p>    The meter should be low-inertial and insensitive to the influence of the main disturbing factors of the mine atmosphere of coal mines.  </p>",
    "p2": "<p>    The main purpose of research is to improve the metrological reliability of the optical adsorption mine methanometer by compensating the main destabilizing factors affecting on the measurement results. </p>  <p>    In order to achieve the objective of this work, the following objectives have been set:  </p>  <ul>    <li>      an analysis of the conditions under which coal mining takes place;    </li>    <li>      analysis of existing methods for measuring methane concentration in coal mine conditions;    </li>    <li>      identification of factors that affects on the results of optical methanometers in coal mine conditions;    </li>    <li>      developing ways to compensate the destabilizing factors;   </li>    <li>      development of mathematical model of methane concentration measurement system;    </li>    <li>      evaluation of metrological reliability parameters.    </li>  </ul>  <p>    The planned result is the introduction of ways to compensate the destabilizing factors, obtaining a mathematical model of the methane concentration measurement system and the structural scheme of the system. </p>",
    "p3": {
      "p1": "The following Generalized structural diagram of the spectral device for determination of methane concentration is proposed, shown in Figure 1.",
      "p2": "Generalized structural diagram of spectral device",
      "p3": "<p>      Spectral device includes: 1 – radiation source, 2 – transmitting optical system, 3 – device for beam decomposition into spectrum, 4 – receiving optical system, 5 – radiation receiver, 6 – recording device.   </p>    <p>      Radiation flux is created by radiation source. The source may be a considerable distance away from or included in the device. Light sources are used to calibrate and calibrate spectral energy characteristics of devices.    </p>    <p>      The transmitting system forms and directs the flow from the source to the radiation decomposition device into a spectrum (dispersing device). Most devices use collimator systems.   </p>    <p>      The most important part of the spectral device is the dispersing device, which decomposes the radiation into monochrome components, i.e. forms a spectrum.   </p>    <p>      The receiving optical system serves to generate a stream at the receiver that is spread into a spectrum.  </p>    <p>      The energy receiver is adapted to convert a signal carried by the stream into an electrical signal.  </p>    <p>      The recording device is designed to amplify the electrical signals of the receiver, convert them into the desired form, and record the spectrum.   </p>    <p>      It should be noted that the individual elements of the optical system may be aligned in a single device or absent. In addition to the above-mentioned units, the spectral device may include additional elements (compensators, modulators, scanning mechanisms, software mode control devices, etc.).   </p>"
    },
    "p4": {
      "p1": "<p>      There are several methods for determining methane concentration in mine conditions: thermocatalytic, thermocomputometric, optical, air-channel and chromatographic methods. </p>    <p>      The thermocatalytic method is based on the oxidation of methane on the surface of the catalytically active element and the measurement of the amount of heat that has been generated. The main advantage of this method is high measurement accuracy (when measuring concentration up to 4%, then <q>rollover</q> occurs, i.e. sharp deterioration of accuracy of indicators). The response speed of modern sensors reaches 4 s. The general view and composition of the thermocatalyst sensor is shown in Figure 2 [<a href='#literature'>1</a>].    </p>",
      "p2": "General view and composition of thermocatalyst sensor"
    },
    "p5": {
      "p1": " Such a sensor may have a metal or plastic housing through which methane diffuses into two sensing elements (ceramic balls). In these balls (so-called pellistor) platinum thread which heats up current to 450 ℃ is placed. The active pelletor is coated with a catalyst that oxidizes methane, resulting in an increase in its temperature. This increase results in a change in the resistance of the platinum thread within the active sensor. Next, the resistance is compared to the resistance of the passive resistance and the concentration of methane is determined. The following is a summary diagram of the thermocatalytic sensor (see Figure 3).",
      "p2": "General diagram of thermocatalyst sensor actuation"
    },
    "p6": {
      "p1": " Thermoconductometric method is based on dependence of thermal conductivity of gas mixture on methane concentration. This method is inferior to thermocatalytic due to poor selectivity and low sensitivity, but has a measurement range of up to 100%. The sensor (see Figure 4) uses two elements heated to a certain temperature. The R4 element is supporting and isolated from the medium to be measured, and air is usually present in its chamber. The R3 element changes its conductivity when methane hits. This signal difference between reference element and active element is directly proportional to methane concentration  [<a href='#literature'>2</a>].    ",
      "p2": "Generalized diagram of thermoconductometric sensor"
    },
    "p7": "<p>    The air-channel method is based on the principle of continuous collection of gas sample by remote sampling and drawing them through the pipe to the station for analysis by means of a gas analyzer. Advantages of this method are low cost of equipment, absence of power sources for devices in underground mining, wide functionality. The disadvantages are also the high delay in the analysis of the air sample due to the time required to transport the gas mixture from the mine to the central gas analysis station. </p>  <p>    The chromatic method is based on the ability of the substances to adsorb on the selected adsorbent (selective adsorption). The adsorbent may be a solid having adsorption properties or a liquid which is applied to the interface of the phase onto the granular inert carrier material to create a larger exchange surface. The disadvantage of this method is poor selectivity and slow response.  </p>  <p>    After analyzing the above methods, assessing their advantages and disadvantages, an optical method for measuring methane concentration was chosen. The essence of this method is selective absorption of infrared radiation by methane molecules in the wavelength region of 3.2 – 3.4 μm     [<a href='#literature'>3</a>]. This method has high speed of operation, has high accuracy and selectivity of measurements, also has low inertia and a large resource of operation of instruments, which highlights it among the above mentioned.  </p>  <p>   Classical theory in explaining infrared absorption assumes that atoms and gas molecules have their own oscillation frequencies characteristic of each gas, and absorption is available whenever the oscillating system and incident radiation are in resonance. </p>  <p>    Quantum theory explains the absorption of electromagnetic waves by transitions of atoms and molecules of gas from a state with less energy to a state with more energy, and it has been established that atoms and molecules can perceive not any small amount of energy, but only strictly defined discrete portions of energy characteristic of a given substance. Most of the energy absorbed by the gases is transferred to heat.   </p>",
    "p8": "Buger 's law establishes a link between the incident flux intensity J and the amount of  dJd<span class='symbol'>n</span>, energy absorbed by the infinitely thin layer  dx of the analysed gas in the spectral range d<span class='symbol'>n</span> (1):",
    "p9": "<p>    <span class='symbol'>n</span> is a wavenumber;  </p>  <p>    K is the absorption coefficient (constant value characterizing the layer absorption and calculated per unit thickness at constant wave number).  </p>",
    "p10": "<p>    <span class='formula-font'>dI( l )</span> is attenuation of directed radiation of intensity   <span class='formula-font'>I</span>    of medium passing through layer with thickness <span class='formula-font'>dl</span>.  </p>",
    "p11": "In the case of a homogeneous environment, the integral form of Buger 's law is of the form (3):",
    "p12": "are intensity of radiation before and after passing the layer of thickness",
    "p13": "Exponent index in the previous formula is called optical thickness of medium (4):",
    "p14": " The x integration of this equation results in a dependence of the value of the passing flux j on the absorption coefficient K, the thickness of the layer x and the value of the incident flux  J<sub>0</sub> in the spectral interval  d<span class='symbol'>n</span> (Lambert 's law) (5):",
    "p15": "<p>    Experimental studies [<a href='#literature'>4</a>] of absorption of radiant energy by medium, density of which is not everywhere the same, Showed that radiant energy undergoes equal changes only by meeting an equal number of particles, Capable of detaining or dispersing rays, and therefore for absorption have values other than thicknesses, And the masses of the substance, i.e. for the radiant energy absorbing gas, Dissolved in substantially non-absorbing gases, the absorption coefficient is proportional to the number of absorbing molecules per unit wavelength (or unit volume), i.e., proportional to the concentration C.  </p>  <p>    For the absorption gas mixture j, according to Beyer 's law, the K coefficient is determined from the ratio  (6):  </p>",
    "p16": "<p>    <span class='formula-font'>K<sub>j</sub></span>    is the absorption coefficient of the j-th component;  </p>  <p>    <span class='formula-font'>C<sub>j</sub></span>    is the concentration of the j-th component in the mixture. </p>",
    "p17": "In turn, the formula may be presented in the following form (7):",
    "p18": "А is a new concentration-independent coefficient characteristic of an absorbing gas molecule.",
    "p19": "As the analysis has shown, it is possible to use known methods to build the designed device. The use of the optical method using modern optics and microelectronics will allow to create a device with high speed for determination of methane concentration in coal mine conditions with improved operational and metrological characteristics.",
    "p20": "After analyzing the controls, which are based on the optical absorption measurement method, a number of destabilizing factors were found: coal dust, the presence of gases and water vapour, temperature and atmospheric pressure. One of the major destabilizing factors of the miner atmosphere is availability of coal dust in an open optical channel of the measuring instrument as light, passing through the pylegazovy environment, is weakened as a result of dispersion and absorption (absorption). Dust also settles on optical elements, and leads to reduction of metrological reliability, transparency of optical components is deteriorated. In order to increase the accuracy of the meter, it is necessary to study the scattering of infrared radiation by dust particles in the working optical channel and the process of forming a dust film on optical components, to develop a method of compensating for the effect of dust on the measurement results. Light passing through the medium in which measurements are made is attenuated by scattering and absorption. The intensity of dispersion of light is not constant and changes depending on the sizes of particles of dust, concentration of dust in the channel, index of refraction and the angle of dispersion between the directions of the falling and diffused light. The presence of dust in the channel results in a process of forming a dust film on the optical components.",
    "p21": {
      "p1": "In the optical gas analyzer, an auto-compensation two-beam optical circuit is used to increase the stability of zero, as well as to compensate for the possible influence of moisture, dust and other factors capable of absorbing light, in which the intensity of two beams passing along the same optical path is measured, and the wavelength of the same optical path is measured. The (measuring) beam is in the absorption region (3.3 μm) and the other (reference) beam is in the transparency region of the detected gas (2.9 μm).",
      "p2": "Scheme of optical channels of methane concentration meter",
      "p3": "Animation: number of frames – 5; Delay between frames – 1 s; Number of repetition cycles – 10; Volume – 34 kB"
    },
    "p22": " <p>    Radiation flows from measuring (LED 1) and compensating (LED 2) light-emitting diodes are supplied to lenses L1 and L3 respectively, which in turn form directed radiation flows supplied to open measuring OC2 and compensating OC1 open optical channels. Infrared flows passed through optical channels are supplied to lenses L2 and L4, which focus parallel directed radiation flows, in which photodetectors are located PD1 and PD2 of main measurement and compensation channels. The received PD1 and PD2 output signals are current signals which values are proportional to the flows of the main and compensation optical channels. </p>  <p>    Light emitting diode OC1 with operating wavelength of 3.3 mcm is used as infrared radiation source of measuring channel of LED-332-NS [<a href='#literature'>6</a>]. For the compensation channel OC2, a light emitting diode   LED29–PR [<a href='#literature'>6</a>]  having an operating wavelength of 2.9 μm can be used. </p>  <p>    Photodiodes PD36-10-TEC [<a href='#literature'>6</a>] can be used as a photodetector.  </p>",
    "p23": "Current methods and means of measuring methane concentration do not provide the necessary speed of methane concentration measuring devices in coal mine conditions. The use of an optical adsorption method, modern optics and microelectronics, as well as the proposed method of compensating for the influence of coal dust on the result of measuring methane concentration will make it possible to create a fast-acting device for determining methane concentration with improved metrological and operational characteristics.",
    "p24": "At the time of writing this auto-revision, master 's work is under development.",
    "sources": {
      "s1": "Термокаталитические (термохимические) сенсоры. [Electronic resource] – Access mode:",
      "s2": "Термокондуктометрический метод измерения концентрации газов. [Electronic resource] – Access mode:",
      "s3": "Бреслер&nbsp;П.И. Оптические абсорбционные газоанализаторы и их применение. – Л.: Энергия, 1980. – 164 с.",
      "s4": "Карпов&nbsp;Е.Ф., Биренберг&nbsp;И.Э. Автоматическая газовая защита и контроль рудничной атмосферы. – М.: Наука, 1984. – 285с.",
      "s5": "ГОСТ 24032 – 80. Приборы шахтные газоаналитические. Общие требования, методы      испытания. – Введ. 01. 01. 1981 /Межгосударственный стандарт. – М.: Издательство      стандартов, 1980. – 36 с. – (Угольная промышленность).",
      "s6": "IBSG [Electronic resource]. – Electronic data. – Access mode:",
      "s7": "Энергетика [Electronic resource]. – Electronic data. – Access mode:"
    }
  }
}