{
  "biography": "<h1>Біографія</h1><p>Я, Савельєв Дмитро Олександрович, народився 16 жовтня 1995 року в місті Донецьк.</p><p>До початку навчання в школі, ходив в дитячий садок. У дитячому садку часто проводили різні вистави за участю дітей, в яких брав участь і я, дуже часто граючи одну з головних ролей або навіть виступав в ролі ведучого.</p><p>Після дитячого саду, коли мені було 7 років, пішов до Ліцею №30 міста Донецьк. Під час навчання в школі дуже часто гуляв на вулиці з друзями в різні ігри і також катався на велосипеді.</p><p> Коли в родині з'явився перший комп'ютер, я потроху почав в ньому розбиратися і вникати в деталі його роботи і функціонування програмного забезпечення.</p><p>Мені дуже подобалося все, що пов'язано з технікою. Тому, після закінчення 9 класу школи, було вирішено вступити до Донецького індустріально-педагогічний технікум на спеціальність <q>Побутова техніка</q>. У технікумі було цікаво навчатися, пізнавати щось нове.</p><p> Під час навчання, на першому курсі, був предмет під назвою <q>Екологія</q>, за результатом проходження курсу якого необхідно було підготувати презентацію на тему, пов'язану з екологією. Вирішено було взяти тему поновлюваних джерел енергії, так як ця тема була пов'язана з технологіями. Підготовлена мною презентація дуже сподобалася викладачеві, і він запропонував мені виступити на конференції, присвяченій охороні навколишнього середовища. Я прийняв пропозицію і почав готуватися. Необхідно було виступати з доповіддю на велику аудиторію. Для виступу я доповнив свою презентацію і підготував доповідь. За підсумком участі в конференції, де виступало багато доповідачів, я отримав перше місце за кращу презентацію.</p><p>Під час навчання у мене з'явився гірський велосипед, на якому я їжджу і досі. Дуже подобаються тривалі поїздки на ньому і відвідування нових для себе місць.</p><p>Потім, після успішного закінчення даного навчального закладу, я вступив до Донецького національного технічного університету на спеціальність <q>Електроніка та наноелектроніка</q>. В період навчання на бакалавраті брав участь в олімпіаді з электронiки, де зайняв одне з призових місць. Також почав захоплюватися грою на барабанній установці, для навчання грі ходив на індивідуальні заняття в один з Палаців Культури. Це заняття мене дуже захоплювало, мені подобалося дізнаватися нові прийоми і стилі гри, а також вивчати сподобалися мені пісні.</p><p>Темою моєї бакалаврської роботи було <q>Розробити електронний пристрій виміру концентрації метану в умовах вугільної шахти</q>. По закінченню бакалаврату з відзнакою вирішив продовжити навчання і вступив на магістратуру в Донецький національний технічний університет.</p><p> Паралельно з початком навчання в магістратурі, почав вивчати веб-розробку, зокрема front-end. В першу чергу почав з основ, таких як HTML і CSS. Потім, для більш поглибленого занурення в тему, вирішив вивчати Javascript і його фреймворки, зокрема React. Спочатку робив односторінкові сайти. Але пізніше, після початку вивчення React, розробляв вже веб-додатки. Також зробив сайт для кафедри <q>Електроніка</q>, на якій проходив навчання в університеті. Пізніше, для розширення кругозору в веб-розробці, вирішив вивчити інший досить популярний фреймворк під назвою Vue.js.</p><p>Темою моєї магістерської дисертації стало удосконалення вже розробленого мною раніше пристрою, а саме:    <q>Дослідження і розробка методів і засобів метрологічної надійності оптичного абсорбційного       шахтного метанометра</q>. Керівником виступив завідувач кафедри <q>Електроніка</q>,    доктор технічних наук, професор Хламов Михайло Георгійович.  </p>  <p>      У моїх планах успішний захист магістерської дисертації, професійний і кар'єрний ріст.  </p>",
  "titleHead": "- Савельєв Дмитро Олександрович - Дослідження і розробка методів і засобів метрологічної надійності оптичного адсорбционного шахтного метанометра",
  "resume": {
    "title": "Коротке резюме магістра",
    "text": "  <p>ПІБ магістра</p><span>Савельєв Дмитро Олександрович</span> <p>Дата народження</p><span>16.10.1995 р.</span>    <p>Місце народження</p><span>Донецьк</span>    <p>Школа</p><span>2003&ndash;2011 рр. Ліцей №30 міста Донецьк</span>    <p>ВНЗ</p><span>2015&ndash;2018 рр. ДонНТУ &ndash; бакалавріат, спеціальність <q>Електроніка та наноелектроніка</q><br>2018&ndash;2020 рр. ДонНТУ &ndash; магістратура, спеціальність <q>Електроніка та наноелектроніка</q></span>    <p>Середній бал</p><span>4.8/відмінно</span>    <p>Володіння мовами</p><span>Російська &ndash; рідна;<br>Українська &ndash; досконало;<br>Англійська &ndash; середній рівень.</span>    <p>Особисті досягнення</p><span>Конференція з охорони навколишнього середовища &ndash; перше місце за кращу презентацію. <br>Олімпіада з электронiки &ndash; одне з призових місць.</span>    <p>Захоплення</p><span>Ігри: комп'ютерні; <br> Музика: рок; <br>Фільми, серіали: детектив, наукова фантастика, трилер, нуар, фентезі, драма, історичний.</span>    <p>Особисті якості</p><span>Відповідальність, здатність до навчання, допитливість, цілеспрямованість.</span>    <p>Володіння комп'ютером</p><span>Операційні системи: Windows, Android, Ubuntu;<br>Прикладні напрямки: Microsoft Office, Adobe Photoshop, Adobe Illustrator, Компас 3D, MathCad, LabView, Proteus, Matlab, DipTrace, Multisim, 3D Max;<br>Мови програмування: JavaScript, C, C++;<br>Середовища розробки: Visual Studio Code, ArduinoIDE, Delphi.</span>    <p>Досвід роботи</p><span>Виробнича практика: ДП МАШИНОБУДІВНИЙ ЗАВОД <q>ІТРАС</q>;<br>Переддипломна практика: ДП МАШИНОБУДІВНИЙ ЗАВОД <q>ІТРАС</q>.</span>    <p>Плани на майбутнє</p><span>Професійний і кар'єрний ріст.</span>    <p>Контактна інформація</p><a href='https://www.linkedin.com/in/dmitry-saveliev-125394197/' target='_blank'>Linkedin</<a>"  
  },
  "abstract": {
    "picture": "Малюнок",
    "where": "де",
    "title": "Реферат за темою випускної роботи",
    "titles": {
      "t1": "Зміст",
      "t2": "Актуальність",
      "t3": "Цель и задачи исследования, планируемые результаты",
      "t4": "Мета і завдання дослідження, плановані результати",
      "t5": "Огляд існуючих методів, засобів і систем вимірювання концентрації метану",
      "t6": "Основні негативні фактори рудничної атмосфери вугільних шахт",
      "t7": "Розробка оптичної схеми вимірювача концентрації метану",
      "t8": "Висновки",
      "t9": "Список джерел"
    },
    "p1": "<p>   Вугільна промисловість несе в собі значиму роль у виробництві електроенергії –    від неї залежить паливний баланс держави. Вугілля грає важливу роль в хімічній і металургійній промисловості. Воно використовується при виробництві карбіду кальцію, електрокорунду, синтетичного рідкого палива, чавуну, сталі, вуглецевого наповнювача для електродних виробів, вапна, цементу, цегли, синтетичного каучуку, пластмас і т.д.  </p>  <p>    Вугілля видобувають відкритим кар'єрним і закритим шахтним способом [7]. Відкритий спосіб застосовується при глибині покладів вугілля до 100 метрів. При цьому проводиться зняття верхнього шару грунту. Далі проводиться дроблення породи за допомогою бульдозерів, водяних гармат, екскаваторів, дробарок і буропідривний відбій вугілля. Цей спосіб охоплює значну площу, економічний, відносно безпечний, має високу швидкість видобутку, але завдає відчутної шкоди навколишньому середовищу, і вугілля, видобуте у такий спосіб, містить багато домішок.  </p>  <p>    Закритий спосіб застосовується в тих випадках, коли вугілля залягає на досить великій глибині. До місця залягання прокладають вертикальні або горизонтальні стовбури, з яких формується шахта. Видобуток вугілля закритим способом може проводитися за допомогою лав або камерно-стовбовим способом (лава – це довгий забій). У вибоях вугілля рубають за допомогою виїмкової комбайна. На поверхню вугілля відправляється за допомогою конвеєра. При цьому способі видобувається майже все вугілля з пласта. При камерно-стовповому методі використовується стовпи і горизонтальні проходи між ними. Цей спосіб застосовують при неглибокому заляганні вугілля.  </p>  <p>   При закритому способі вугілля видобувається високої якості, приноситься менше шкоди навколишньому середовищу, але володіє високою небезпекою і вимагає великих фінансових вкладень.  </p>  <p>    Проблема при закритому видобутку вугілля полягає в наступному: при видобутку вугілля є небезпека вибуху метану. Для того, щоб запобігти цьому, в шахтах застосовується система аерогазового контролю, що здійснює автоматичне відключення електрики на ділянці шахти, де відбулося перевищення норми концентрації метану. </p>  <p>    Згідно з нормами [5], час спрацьовування нешвидкодіючого датчика – 15 с, швидкодіючого (при концентрації метану 2%, при швидкості росту 0,5% в 1 с) – 0,8 с.  </p>  <p>    Існуючі стаціонарні засоби контролю концентрації метану мають загальний недолік — низьку швидкодію, обумовлену значною інерційністю визначення концентрації метану.  </p>  <p>   Вимірювач повинен бути малоінерційним і нечутливим до впливу основних негативних факторів рудничної атмосфери вугільних шахт. </p>",
    "p2": "<p>    Метою дослідження є підвищення метрологічної надійності оптичного адсорбційного шахтного метанометра шляхом компенсації основних дестабілізуючих факторів, що впливають на результати вимірювання.  </p>  <p>    Для досягнення мети даної роботи поставлені наступні завдання:  </p>  <ul>    <li>      аналіз умов, в яких здійснюється видобуток вугілля;    </li>    <li>      аналіз існуючих методів вимірювання концентрації метану в умовах вугільної шахти;    </li>    <li>      виявлення чинників, що впливають на показання оптичних метанометрів в умовах вугільної шахти;    </li>    <li>      розробка шляхів компенсації впливу дестабілізуючих чинників;   </li>    <li>      розробка математичної моделі системи вимірювання концентрації метану;   </li>    <li>      оцінка параметрів метрологічної надійності.    </li>  </ul>  <p>    Планованим результатом є впровадження шляхів компенсації дестабілізуючих факторів, отримання математичної моделі системи вимірювання концентрації метану і структурної схеми системи. </p>",
    "p3": {
      "p1": "Пропонується наступна узагальнена структурна схема спектрального пристрою визначення концентрації метану, яка представлена на малюнку 1.",
      "p2": "Узагальнена структурна схема спектрального пристрою",
      "p3": "<p>      До складу спектрального пристрою входять: 1 – джерело випромінювання, 2 – оптична система, яка передає, 3 – пристрій для розкладання променів в спектр, 4 – приймальна оптична система, 5 – приймач випромінювання, 6 – пристрій, що реєструє. </p>    <p>      Потік випромінювання створюється за допомогою джерела випромінювання. Джерело може бути віддалений від пристрою на значну відстань або входити до його складу. Для градуювання і калібрування спектральних енергетичних характеристик пристроїв використовуються джерела світла.   </p>    <p>      Система, яка передає, формує і направляє потік від джерела на пристрій для розкладання випромінювання в спектр (диспергуючий пристрій). У більшості пристроїв використовуються коллиматорні системи.  </p>    <p>     Найбільш важливою частиною спектрального пристрою є диспергуючий пристрій, який здійснює розкладання випромінювання на монохромні складові, тобто утворює спектр.  </p>    <p>      Приймальна оптична система служить для формування на приймачі потоку, який розкладений в спектр.   </p>    <p>    Приймач енергії призначений для перетворення сигналу, що переноситься потоком, в електричний сигнал.   </p>    <p>      Реєструючий пристрій призначений для посилення електричних сигналів приймача, перетворення їх в потрібний вид, і записи спектра.   </p>    <p>      Слід зазначити, що окремі елементи оптичної системи можуть бути суміщені в одному пристрої або бути відсутнім. Крім перерахованих вище вузлів до складу спектрального пристрою можуть входити додаткові елементи (компенсатори, модулятори, скануючі механізми, пристрої програмного управління режимом роботи і т. п.).   </p>"
    },
    "p4": {
      "p1": "<p>      Існує кілька методів визначення концентрації метану в умовах шахти: термокаталітичний, термокондуктометричний, оптичний, повітряно-канальний і хроматографічний методи.    </p>    <p>      Термокаталітичний метод заснований на окисленні метану на поверхні каталітично активного елементу і вимірюванні кількості тепла, яке виділилося при цьому. Головною перевагою цього методу є висока точність вимірювання (при вимірюванні концентрації до 4%, далі — відбувається «перекидання», тобто різке погіршення точності показників). Швидкодія сучасних датчиків досягає 4 с. Загальний вигляд і склад термокаталітичного сенсора наведено на малюнку 2 [1].   </p>",
      "p2": "Загальний вигляд і склад термокаталітичного сенсора"
    },
    "p5": {
      "p1": "<p>      Такий сенсор може мати металевий або пластиковий корпус, через мембрану якого метан дифундує на два чутливих елемента (керамічні кульки). Усередині цих кульок (т.зв. пеллісторів) розміщена платинова нитка, яка нагрівається струмом до 450 ℃. Активний пеллістер покритий каталізатором, який окисляє метан, що призводить до підвищення його температури. Це підвищення призводить до зміни опору платинової нитки всередині активного чутливого елемента. Далі опір порівнюється з опором пасивного і визначається концентрація метану. Нижче наведена узагальнена схема включення термокаталітичного сенсора (див. мал. 3).   </p>",
      "p2": "Узагальнена схема включення термокаталітичного сенсора"
    },
    "p6": {
      "p1": "<p>      Термокондуктометричний метод заснований на залежності теплопровідності газової суміші від концентрації метану. Цей метод поступається термокаталітичному через погану селективність і малу чутливість, але володіє діапазоном вимірювання до 100%. У сенсорі (див. мал. 4) застосовуються два елементи, нагріті до певної температури. Елемент R4 є опорним і ізольований від вимірюваного середовища, в його камері зазвичай знаходиться повітря. Елемент R3 змінює свою провідність при попаданні метану. Ця різниця сигналу між еталонним елементом і активним прямо пропорційна концентрації метану [2]. </p>",
      "p2": "Узагальнена схема термокондуктометричного сенсора"
    },
    "p7": "<p>    Повітряно-канальний метод заснований на принципі безперервного збору проби газу шляхом дистанційного забору і протягання їх по трубі до станції для аналізу за допомогою газоаналізатора. Перевагами даного методу є низька вартість апаратури, відсутність джерел живлення для пристроїв в підземній виробці, широка функціональність. Недоліки ж зводяться до високої затримки аналізу проби повітря через наявність часу, який необхідний для транспортування газової суміші від шахтної виробки до центрального газоаналітичного пункту.  </p>  <p>    В основі хроматичного методу лежить здатність речовин адсорбуватися на обраному адсорбенті (виборча адсорбція). Адсорбент може бути твердим тілом, що володіє адсорбційними властивостями, або рідиною, яка наноситься на межі розділу фази на гранульований інертний матеріал-носій для створення більшої поверхні обміну. Недоліком цього методу є погана селективність і невисока швидкодія. </p>  <p>   Після проведення аналізу перерахованих вище методів, оцінки їх переваг і недоліків, був обраний оптичний метод вимірювання концентрації метану. Суть цього методу полягає у виборчому поглинанні інфрачервоного випромінювання молекулами метану в області довжин хвиль 3,2 — 3,4 мкм [3]. Цей метод володіє високою швидкодією, має високу точність і селективність вимірювань, також має малу інерційністю і великий ресурс експлуатації приладів, що виділяє його серед перерахованих вище.  </p>  <p>    Класична теорія при поясненні поглинання інфрачервоного випромінювання виходить з того, що атоми і молекули газів володіють власними частотами коливань, характерними для кожного газу, і поглинання є всякий раз, коли коливається система і падаюча радіація знаходяться в резонансі. </p>  <p>    Квантова теорія пояснює поглинання електромагнітних хвиль переходами атомів і молекул газу зі стану з меншою енергією в стан з більшою енергією, при цьому встановлено, що атоми і молекули можуть сприймати не будь-яку як завгодно малу величину енергії, а тільки строго певні, характерні для даної речовини дискретні порції енергії. Велика частина енергії, що поглинається газами, переходить в тепло [6]. </p>",
    "p8": "Закон Бугера встановлює зв'язок між інтенсивністю J ппадаючого потоку випромінювання і кількістю енергії  dJd<span class='symbol'>n</span>, що поглинається нескінченно тонким шаром  dx аналізованого газу в спектральному інтервалі d<span class='symbol'>n</span> (1):",
    "p9": "<p>    <span class='symbol'>n</span> – хвильове число;  </p>  <p>    K – коефіцієнт поглинання (постійна величина, що характеризує поглинання шару і розрахована на одиницю товщини при постійному хвильовому числі).  </p>",
    "p10": "<p>    <span class='formula-font'>dI( l )</span> – ослаблення спрямованого випромінювання інтенсивності    <span class='formula-font'>I</span>    минулого шар середовища товщиною <span class='formula-font'>dl</span>.  </p>",
    "p11": "У разі однорідного середовища інтегральна форма закону Бугера має вигляд (3):",
    "p12": "інтенсивності випромінювання до і після проходження шару товщиною",
    "p13": "Показник експоненти в попередній формулі прийнято називати оптичною товщею середовища (4):",
    "p14": "Інтегрування цього рівняння по х дає залежність величини прохідного потоку j     від коефіцієнта поглинання К, товщини шару х і величини падаючого потоку J<sub>0</sub> в спектральному інтервалі  d<span class='symbol'>n</span> (закон Ламберта) (5):",
    "p15": "<p>    Експериментальні дослідження [4] поглинання променистої енергії середовищем, щільність якої не скрізь однакова, показали, що промениста енергія зазнає рівні зміни, лише зустрічаючи рівне число частинок, здатних затримувати промені або розсіювати їх, і, отже, для поглинання мають значення не товщини, а маси речовини, тобто    для поглинає променисту енергію газу, розчиненого в практично непоглинаючих газах, коефіцієнт поглинання пропорційний числу поглинаючих молекул на одиницю довжини шляху хвилі (або на одиницю об'єму), тобто пропорційний концентрації С.    </p>  <p>    Для суміші j поглинаючих газів, згідно закону Беера, коефіцієнт К визначається зі співвідношення (6):  </p>",
    "p16": "<p>    <span class='formula-font'>K<sub>j</sub></span>    – коефіцієнт поглинання j-го компонента;  </p>  <p>    <span class='formula-font'>C<sub>j</sub></span>    – концентрація j-го компонента в суміші.  </p>",
    "p17": "У свою чергу формула з урахуванням викладеного може бути представлена в наступній формі (7):",
    "p18": "А — новий коефіцієнт, що не залежить від концентрації і характерний для молекули поглинаючого газу.",
    "p19": "Як показав проведений аналіз, є можливість використовувати відомі методи для побудови проектованого пристрою. Використання оптичного методу із застосуванням сучасних засобів оптики і мікроелектроніки дозволить створити пристрій з високою швидкодією для визначення концентрації метану в умовах вугільної шахти з поліпшеними експлуатаційними та метрологічними характеристиками.",
    "p20": "Проаналізувавши засоби контролю, які засновані на оптико-абсорбційному методі виміру, був виявлений ряд дестабілізуючих факторів: вугільний пил, наявність газів і пари води, температура і атмосферний тиск. Одним з основних дестабілізуючих факторів рудничної атмосфери є наявність вугільного пилу у відкритому оптичному каналі вимірювача, так як світло, проходячи через пилогазову середу, послаблюється в результаті розсіювання і поглинання (абсорбції). Пил також осідає на оптичних елементах, і веде до зниження метрологічної надійності, погіршується прозорість оптичних компонентів. Для підвищення точності вимірювача необхідно досліджувати розсіювання інфрачервоного випромінювання частинками пилу в робочому оптичному каналі і процес формування плівки пилу на оптичних компонентах, розробити метод компенсації впливу пилу на результати вимірювань. Світло, що проходить через середу, в якій виконуються вимірювання, послаблюється в результаті розсіювання і поглинання (абсорбції). Інтенсивність розсіювання світла не постійна і змінюється в залежності від розмірів частинок пилу, концентрації пилу в каналі, коефіцієнта заломлення і кута розсіювання між напрямками падаючого і розсіяного світла. Наявність пилу в каналі призводить до процесу формування плівки пилу на оптичних компонентах.",
    "p21": {
      "p1": "В оптичному газоаналізаторі для збільшення стабільності нуля, а також для компенсації можливого впливу вологи, пилу та інших факторів, здатних поглинати світло, використовується автокомпенсаційна двопроменева оптична схема, в якій вимірюється інтенсивність двох променів, що проходять по одному і тому ж оптичному шляху, причому, довжина хвилі одного (вимірювального) променя знаходиться в області поглинання (3.3 мкм), а іншого (опорного) — в області прозорості визначуваного газу (2.9 мкм).",
      "p2": "Анімація оптичних каналів вимірювача концентрації метану",
      "p3": "Анімація: кількість кадрів – 5;            затримка між кадрами – 1 с; кількість циклів повторення – 10; объём – 34 кБ"
    },
    "p22": " <p>    Потоки випромінювання від вимірювального (СИД 1) і компенсаційного (СИД 2) світловипромінювальних діодів надходять на об'єктиви О1 і О3 відповідно, які в свою чергу формують спрямовані потоки випромінювання, що надходять у відкритих вимірювальний ОК2 і компенсаційний ОК1 оптичні канали. Минулі через оптичні канали, інфрачервоні потоки надходять на об'єктиви О2 і О4, які фокусують паралельно направлені потоки випромінювання, в яких розташовуються фотодетектори ФД1 і ФД2 основного вимірювального і компенсаційного каналів. Отримані вихідні сигнали ФД1 і ФД2 — сигнали струму, значення яких пропорційні потокам основного і компенсаційного оптичних каналів.  </p>  <p>   Як джерело інфрачервоного випромінювання вимірювального каналу ОК1 доцільно використовувати світловипромінювальних діод LED-332-NS [6] з робочою довжиною хвилі 3,3 мкм. Для компенсаційного каналу ОК2 можна використовувати світловипромінювальних діод LED29-PR [6], який має робочу довжину хвилі 2,9 мкм. </p>  <p>    Як фотоприймач можна використовувати фотодіоди PD36-10-TEC [6].  </p>",
    "p23": "Існуючі на сьогоднішній день методи та засоби вимірювання концентрації метану не забезпечують необхідну швидкодію пристроїв вимірювання концентрації метану в умовах вугільної шахти. Використання оптико-адсорбційного методу, сучасних засобів оптики і мікроелектроніки, а також запропонованого способу компенсації впливу вугільного пилу на результат вимірювання концентрації метану дозволить створити швидкодіючий прилад для визначення концентрації метану з поліпшеними метрологічними і експлуатаційними характеристиками.",
    "p24": "На момент написання даного автореферату магістерська робота знаходиться на стадії розробки.",
    "sources": {
      "s1": "Термокаталитические (термохимические) сенсоры. [Електронний ресурс] – Режим доступу:",
      "s2": "Термокондуктометрический метод измерения концентрации газов. [Електронний ресурс] – Режим доступу:",
      "s3": "Бреслер П.И. Оптические абсорбционные газоанализаторы и их применение. – Л.: Энергия, 1980. – 164 с.",
      "s4": "Карпов Е.Ф., Биренберг И.Э. Автоматическая газовая защита и контроль рудничной атмосферы. – М.: Наука, 1984. – 285с.",
      "s5": "ГОСТ 24032 – 80. Приборы шахтные газоаналитические. Общие требования, методы      испытания. – Введ. 01. 01. 1981 /Межгосударственный стандарт. – М.: Издательство      стандартов, 1980. – 36 с. – (Угольная промышленность).",
      "s6": "IBSG [Електронний ресурс]. – Електронні дані. – Режим доступу:",
      "s7": "Энергетика [Електронний ресурс]. – Електронні дані. – Режим доступу:"
    }
  }
}