<template>
  <section>
    <h1>
      {{ title }}
    </h1>
    <h2>Введение</h2>
    <p>
      Угольная промышленность несет в себе значимую роль в производстве электроэнергии –
      от нее зависит топливный баланс государства. Уголь играет важную роль в химической и
      металлургической промышленности. Он используется при производстве карбида кальция, электрокорунда,
      синтетического жидкого топлива, чугуна, стали, углеродистого наполнителя для электродных изделий,
      извести, цемента, кирпича, синтетического каучука, пластмасс и т.д.
    </p>
    <p>
      Уголь добывают открытым карьерным и закрытым шахтным способом.
      Открытый способ применяется при глубине залежей угля до 100 метров.
      При этом производится снятие верхнего слоя почвы. Далее производится дробление породы при
      помощи бульдозеров, водяных пушек, экскаваторов, дробилок и буровзрывной отбойки угля.
      Этот способ охватывает значительную площадь, экономичен, относительно безопасен, имеет
      высокую скорость добычи, но наносит ощутимый вред окружающей среде, и уголь,
      добытый таким способом, содержит много примесей.
    </p>
    <p>
      Закрытый способ применяется в тех случаях, когда уголь залегает на достаточно большой глубине.
      До места залегания прокладывают вертикальные или горизонтальные стволы, из которых формируется
      шахта. Добыча угля закрытым способом может производиться с помощью лав или камерно-столбовым
      способом (лава - это длинный забой). В забоях уголь рубят при помощи выемочного комбайна.
      На поверхность уголь отправляется при помощи конвейера. При этом способе добывается почти
      весь уголь из пласта. При камерно-столбовом методе используются столбы и горизонтальные проходы
      между ними. Этот способ применяют при неглубоком залегании угля.
    </p>
    <p>
      При закрытом способе уголь добывается высокого качества, приносится меньше вреда окружающей среде,
      но обладает высокой опасностью и требует больших финансовых вложений.
    </p>
    <p>
      Проблема при закрытой добыче угля заключается в следующем: при добыче угля есть опасность
      взрыва метана. Для того, чтобы предотвратить это, в шахтах применяется система аэрогазового
      контроля, осуществляющая автоматическое отключение электричества на участке шахты,
      где произошло превышение нормы концентрации метана.
    </p>
  </section>
</template>

<script>
import { mapState } from 'vuex'

export default {
  head () {
    return {
      title: this.titleHead
    }
  },
  components: {
  },
  computed: {
    ...mapState({
      lang: state => state.currentLang.lang
    }),
    titleHead () {
      if (this.lang === 'en') {
        return `Abstract ${this.$t('titleHead')}`
      }

      return `Реферат ${this.$t('titleHead')}`
    },
    // content () {
    //   return this.$t('abstract.text')
    // },
    title () {
      return this.$t('abstract.title')
    }
  }
}
</script>

<style lang="scss" scoped>
@import "~/assets/style/media_mixin.scss";
@import "~/assets/style/var.scss";

section {
   text-align: justify;

   p {
     font-size: 1.8rem;
     text-indent: 2.5rem;
     line-height: 2.6rem;
   }

   h1 {
     font-size: 3rem;
     text-align: center;
     color: $main-blue;
     margin-bottom: 5rem;
   }

   h2 {
    font-size: 2rem;
    color: $main-blue;
    margin-bottom: 2rem;
    margin-top: 3rem;
    text-align: left;
  }
 }

  li {
   &+& {
     margin-top: .5rem;
   }
 }

 ul {
   font-size: 1.8rem;
 }

   a {
    text-decoration: none;

      &:hover {
        text-decoration: underline;
      }
  }
 </style>
