<template>
  <section>
    <h1>
      {{ title }}
    </h1>
    <h2>{{ titles.t1 }}</h2>
    <div class="links">
      <a href="#relevance">{{ titles.t2 }}</a>
      <a href="#target">{{ titles.t3 }}</a>
      <a href="#structure">{{ titles.t4 }}</a>
      <a href="#overview">{{ titles.t5 }}</a>
      <a href="#factors">{{ titles.t6 }}</a>
      <a href="#development">{{ titles.t7 }}</a>
      <a href="#conclusions">{{ titles.t8 }}</a>
      <a href="#literature">{{ titles.t9 }}</a>
    </div>
    <h2 id="relevance">
      {{ titles.t2 }}
    </h2>
    <div v-html="abstract.p1" />
    <!-- <p>
      Угольная промышленность несет в себе значимую роль в производстве электроэнергии –
      от нее зависит топливный баланс государства. Уголь играет важную роль в химической и
      металлургической промышленности. Он используется при производстве карбида кальция, электрокорунда,
      синтетического жидкого топлива, чугуна, стали, углеродистого наполнителя для электродных изделий,
      извести, цемента, кирпича, синтетического каучука, пластмасс и т.д.
    </p>
    <p>
      Уголь добывают открытым карьерным и закрытым шахтным способом [7].
      Открытый способ применяется при глубине залежей угля до 100 метров.
      При этом производится снятие верхнего слоя почвы. Далее производится дробление породы при
      помощи бульдозеров, водяных пушек, экскаваторов, дробилок и буровзрывной отбойки угля.
      Этот способ охватывает значительную площадь, экономичен, относительно безопасен, имеет
      высокую скорость добычи, но наносит ощутимый вред окружающей среде, и уголь,
      добытый таким способом, содержит много примесей.
    </p>
    <p>
      Закрытый способ применяется в тех случаях, когда уголь залегает на достаточно большой глубине.
      До места залегания прокладывают вертикальные или горизонтальные стволы, из которых формируется
      шахта. Добыча угля закрытым способом может производиться с помощью лав или камерно-столбовым
      способом (лава - это длинный забой). В забоях уголь рубят при помощи выемочного комбайна.
      На поверхность уголь отправляется при помощи конвейера. При этом способе добывается почти
      весь уголь из пласта. При камерно-столбовом методе используются столбы и горизонтальные проходы
      между ними. Этот способ применяют при неглубоком залегании угля.
    </p>
    <p>
      При закрытом способе уголь добывается высокого качества, приносится меньше вреда окружающей среде,
      но обладает высокой опасностью и требует больших финансовых вложений.
    </p>
    <p>
      Проблема при закрытой добыче угля заключается в следующем: при добыче угля есть опасность
      взрыва метана. Для того, чтобы предотвратить это, в шахтах применяется система аэрогазового
      контроля, осуществляющая автоматическое отключение электричества на участке шахты,
      где произошло превышение нормы концентрации метана.
    </p>
    <p>
      Согласно нормам [5], время срабатывания небыстродействующего датчика – 15 с, быстродействующего
      (при концентрации метана 2%, при скорости роста 0,5% в 1 с) – 0,8 с.
    </p>
    <p>
      Существующие стационарные средства контроля концентрации метана обладают общим недостатком –
      низким быстродействием,
      обусловленным значительной инерционностью определения концентрации метана.
    </p>
    <p>
      Измеритель должен быть малоинерционным и нечувствительным к
      влиянию основных возмущающих факторов рудничной атмосферы угольных шахт.
    </p> -->
    <h2 id="target">
      {{ titles.t3 }}
    </h2>
    <div v-html="abstract.p2" />
    <!-- <p>
      Целью исследования является повышение метрологической надежности оптического адсорбционного шахтного метанометра путем компенсации
      основных дестабилизирующих факторов, влияющих на результаты измерения.
    </p>
    <p>
      Для достижения цели данной работы поставлены следующие задачи:
    </p>
    <ul>
      <li>
        анализ условий, в которых осуществляется добыча угля;
      </li>
      <li>
        анализ существующих методов измерения концентрации метана в условиях угольной шахты;
      </li>
      <li>
        выявление факторов, влияющих на показания оптических метанометров в условиях угольной шахты;
      </li>
      <li>
        разработка путей компенсации влияния дестабилизирующих факторов;
      </li>
      <li>
        разработка математической модели системы измерения концентрации метана;
      </li>
      <li>
        оценка параметров метрологической надежности.
      </li>
    </ul>
    <p>
      Планируемым результатом является внедрение путей компенсации дестабилизирующих факторов,
      получение математической модели системы измерения концентрации метана и структурной схемы системы.
    </p> -->
    <h2 id="structure">
      {{ titles.t4 }}
    </h2>
    <p v-html="abstract.p3.p1">
      <!-- Предлагается следующая Обобщённая структурная схема спектрального
      устройства определения концентрации метана, представленная на рисунке 1. -->
    </p>
    <div class="chart-wrap">
      <img src="~/assets/imgs/abs_1.png" alt="Обобщенная структурная схема спектрального устройства" class="chart">
      <p>
        {{ abstract.picture }} 1 – {{ abstract.p3.p2 }}
      </p>
    </div>
    <div v-html="abstract.p3.p3" />
    <!-- <p>
      В состав спектрального устройства входят: 1 – источник излучения, 2 – передающая оптическая система,
      3 – устройство для разложения лучей в спектр,
      4 – приемная оптическая система, 5 – приемник излучения, 6 – регистрирующее устройство.
    </p>
    <p>
      Поток излучения создается с помощью источника излучения. Источник может быть удален от
      устройства на значительное расстояние или входить в его состав. Для градуировки и калибровки
      спектральных энергетических характеристик устройств используются источники света.
    </p>
    <p>
      Передающая система формирует и направляет поток от источника на устройство для
      разложения излучения в спектр (диспергирующее устройство).
      В большинстве устройств используются коллиматорные системы.
    </p>
    <p>
      Наиболее важной частью спектрального устройства является диспергирующее устройство,
      которое осуществляет
      разложение излучения на монохромные составляющие, т.е. образует спектр.
    </p>
    <p>
      Приемная оптическая система служит для формирования на приемнике потока, который разложен в спектр.
    </p>
    <p>
      Приемник энергии предназначен для преобразования сигнала, переносимого потоком, в электрический сигнал.
    </p>
    <p>
      Регистрирующее устройство предназначено для усиления электрических сигналов приемника,
      преобразования их в нужный вид, и записи спектра.
    </p>
    <p>
      Следует отметить, что отдельные элементы оптической системы могут быть совмещены в
      одном устройстве или отсутствовать. Кроме вышеперечисленных узлов в состав спектрального устройства могут входить дополнительные элементы (компенсаторы, модуляторы, сканирующие механизмы,
      устройства программного управления режимом работы и т. п.).
    </p> -->
    <h2 id="overview">
      {{ titles.t5 }}
    </h2>
    <div v-html="abstract.p4.p1" />
    <!-- <p>
      Существует несколько методов определения концентрации метана в условиях шахты: термокаталитический,
      термокондуктометрический, оптический, воздушно-канальный и хроматографический методы.
    </p>
    <p>
      Термокаталитический метод основан на окислении метана на поверхности каталитически активного
      элемента и измерении количества тепла, которое выделилось при этом. Главным преимуществом
      этого метода является высокая точность измерения (при измерении концентрации до 4%,
      далее – происходит «опрокидывание», т.е. резкое ухудшение точности показателей).
      Быстродействие современных датчиков достигает 4 с.
      Общий вид и состав термокаталитического сенсора приведен на рисунке 2 [1].
    </p> -->
    <div class="chart-wrap">
      <img v-if="lang === 'ru'" src="~/assets/imgs/abs_2_ru.jpg" :alt="abstract.p4.p2" class="chart">
      <img v-if="lang === 'uk'" src="~/assets/imgs/abs_2_uk.jpg" :alt="abstract.p4.p2" class="chart">
      <img v-if="lang === 'en'" src="~/assets/imgs/abs_2_en.jpg" :alt="abstract.p4.p2" class="chart">
      <p>
        <!-- Рисунок 2 – Общий вид и состав термокаталитического сенсора -->
        {{ abstract.picture }} 2 – {{ abstract.p4.p2 }}
      </p>
    </div>
    <p>
      <!-- Такой сенсор может иметь металлический или пластиковый корпус,
      через мембрану которого метан диффундирует на два чувствительных элемента (керамических шарика).
      Внутри этих шариков (т.н. пеллисторов) размещена платиновая нить, которая нагревается током до 450 ℃.
      Активный пеллистор покрыт катализатором, который окисляет метан, что приводит к повышению его
      температуры. Это повышение приводит к изменению сопротивления платиновой нити внутри активного
      чувствительного элемента. Далее сопротивление сравнивается с сопротивление пассивного и определяется
      нцентрация метана.
      Ниже приведена обобщенная схема включения термокаталитического сенсора (см. рис. 3). -->
      {{ abstract.p5.p1 }}
    </p>
    <div class="chart-wrap">
      <img v-if="lang === 'ru'" src="~/assets/imgs/abs_3_ru.jpg" :alt="abstract.p5.p2" class="chart">
      <img v-if="lang === 'uk'" src="~/assets/imgs/abs_3_uk.jpg" :alt="abstract.p5.p2" class="chart">
      <img v-if="lang === 'en'" src="~/assets/imgs/abs_3_en.jpg" :alt="abstract.p5.p2" class="chart">
      <p>
        <!-- Рисунок 3 – Обобщенная схема включения термокаталитического сенсора -->
        {{ abstract.picture }} 3 – {{ abstract.p5.p2 }}
      </p>
    </div>
    <p v-html="abstract.p6.p1">
      <!-- Термокондуктометрический метод основан на зависимости теплопроводности газовой смеси от
      концентрации метана. Этот метод уступает термокаталитическому из-за плохой селективности и
      малой чувствительности, но обладает диапазоном измерения до 100%.  В сенсоре (см. рис 4)
      применяются два элемента, нагретые до определенной температуры. Элемент R4 является опорным и
      изолирован от измеряемой среды, в его камере обычно находится воздух. Элемент R3 изменяет свою
      проводимость при попадании метана. Эта разница сигнала между
      эталонным элементом и активным прямо пропорциональна концентрации метана [2]. -->
      <!-- {{ abstract.p6.p1 }} -->
    </p>
    <div class="chart-wrap">
      <img src="~/assets/imgs/abs_4.png" :alt="abstract.p6.p2" class="chart">
      <p>
        <!-- Рисунок 4 – Обобщенная схема термокондуктометрического сенсора -->
        {{ abstract.picture }} 4 – {{ abstract.p6.p2 }}
      </p>
    </div>
    <div v-html="abstract.p7" />
    <!-- <p>
      Воздушно-канальный метод основан на принципе непрерывного сбора пробы газа путем дистанционного
      забора и протяжки их по трубе к станции для анализа с помощью газоанализатора. Преимуществами
      данного метода является низкая стоимость аппаратуры, отсутствие источников питания для устройств
      в подземной выработке, широкая функциональность. Недостатки же сводятся к высокой задержке анализа
      пробы воздуха из-за наличия времени, которое необходимо для транспортировки газовой смеси от
      шахтной выработки до центрального газоаналитического пункта.
    </p>
    <p>
      В основе хроматического метода лежит способность веществ адсорбироваться на выбранном адсорбенте
      (избирательная адсорбция). Адсорбент может быть твердым телом, владеющим адсорбционными свойствами,
      или жидкостью, которая наносится на грани раздела фазы на гранулированный инертный материал-носитель
      для создания большей поверхности обмена.
      Недостатком этого метода является плохая селективность и невысокое быстродействие.
    </p>
    <p>
      После проведения анализа вышеперечисленных методов, оценки их достоинств и недостатков,
      был выбран оптический метод измерения концентрации метана. Суть этого метода заключается
      в избирательном поглощении инфракрасного излучения молекулами метана в области длин волн 3,2 – 3,4 мкм
      [3]. Этот метод обладает высоким быстродействием, имеет высокую точность и селективность измерений,
      также обладает малой инерционностью и большим ресурсом эксплуатации приборов,
      что выделяет его среди вышеперечисленных.
    </p>
    <p>
      Классическая теория при объяснении поглощения инфракрасного излучения исходит из того,
      что атомы и молекулы газов обладают собственными частотами колебаний, характерными для каждого газа,
      и поглощение имеется всякий раз,
      когда колеблющаяся система и падающая радиация находятся в резонансе.
    </p>
    <p>
      Квантовая теория объясняет поглощение электромагнитных волн переходами атомов и молекул газа
      из состояния с меньшей энергией в состояние с большей энергией, при этом установлено, что атомы
      и молекулы могут воспринимать не любую сколь угодно малую величину энергии, а только строго
      определенные, характерные для данного вещества дискретные порции энергии.
      Большая часть энергии, поглощаемая газами, переходит в тепло [6].
    </p> -->
    <p v-html="abstract.p8">
      <!-- Закон Бугера устанавливает связь между интенсивностью J падающего потока излучения и
      количеством энергии dJd<span class="symbol">n</span>, поглощаемой бесконечно тонким слоем dx анализируемого газа в
      спектральном интервале d<span class="symbol">n</span> (1): -->
    </p>
    <div class="formula-wrap">
      <p class="formula">
        d ⋅ I ⋅ d ⋅ <span class="symbol">n</span> = - K ⋅ J ⋅ dx ⋅ d<span class="symbol">n</span>
      </p>
      <span class="formula-num">(1)</span>
    </div>
    <div class="desc">
      {{ abstract.where }}
      <div v-html="abstract.p9" />
      <!-- <p>
        <span class="symbol">n</span> – волновое число;
      </p>
      <p>
        K – коэффициент поглощения (постоянная величина, характеризующая поглощение
        слоя и рассчитанная на единицу толщины при постоянном волновом числе).
      </p> -->
    </div>
    <div class="formula-wrap">
      <p class="formula">
        dI( l ) = - k( l ) ⋅ I( l ) ⋅ dl
      </p>
      <span class="formula-num">(2)</span>
    </div>
    <div class="desc">
      {{ abstract.where }}
      <div v-html="abstract.p10" />
      <!-- <p>
        <span class="formula-font">dI( l )</span> – ослабление направленного излучения интенсивности
        <span class="formula-font">I</span>
        прошедшего слой среды толщиной <span class="formula-font">dl</span>.
      </p> -->
    </div>
    <p>
      <!-- В случае однородной среды интегральная форма закона Бугера имеет вид (3): -->
      {{ abstract.p11 }}
    </p>
    <div class="formula-wrap">
      <p class="formula">
        I( l ) = I<sub>0</sub> e<sup>- k( l )l</sup>
      </p>
      <span class="formula-num">(3)</span>
    </div>
    <div class="desc">
      {{ abstract.where }}
      <p>
        <span class="formula-font">I<sub>0</sub></span>,
        <span class="formula-font">I</span> – {{ abstract.p12 }}
        <span class="formula-font">l</span>.
      </p>
    </div>
    <p>
      <!-- Показатель экспоненты в предыдущей формуле принято называть оптической толщей среды (4): -->
      {{ abstract.p13 }}
    </p>
    <div class="formula-wrap">
      <p class="formula">
        τ = k( l )l
      </p>
      <span class="formula-num">(4)</span>
    </div>
    <p v-html="abstract.p14">
      <!-- Интегрирование этого уравнения по х дает зависимость величины проходящего потока j
      от коэффициента поглощения К, толщины слоя х и величины падающего потока J<sub>0</sub> в
      спектральном интервале d<span class="symbol">n</span> (закон Ламберта) (5): -->
    </p>
    <div class="formula-wrap">
      <p class="formula">
        J ⋅ d<span class="symbol">n</span> = J<sub>0</sub> ⋅ e<sup>- K ⋅ x</sup> ⋅ d<span class="symbol">n</span>
      </p>
      <span class="formula-num">(5)</span>
    </div>
    <div v-html="abstract.p15" />
    <!-- <p>
      Экспериментальные исследования [4] поглощения лучистой энергии средой, плотность
      которой не везде одинакова, показали, что лучистая энергия претерпевает равные изменения,
      лишь встречая равное число частиц, способных задерживать лучи или рассеивать их, и, следовательно,
      для поглощения имеют значения не толщины, а массы вещества, т. е. для поглощающего лучистую энергию
      газа, растворенного в практически непоглощающих газах, коэффициент поглощения пропорционален числу
      поглощающих молекул на единицу длины пути волны (или на единицу объема),
      т. е. пропорционален концентрации С.
    </p>
    <p>
      Для смеси j поглощающих газов, согласно закона Беера, коэффициент К определяется из соотношения (6):
    </p> -->
    <div class="formula-wrap">
      <p class="formula">
        K = ∑<sup>j</sup><sub>j=1 </sub>C<sub>j</sub> ⋅ K<sub>j</sub>
      </p>
      <span class="formula-num">(6)</span>
    </div>
    <div class="desc">
      {{ abstract.where }}
      <div v-html="abstract.p16" />
      <!-- <p>
        <span class="formula-font">K<sub>j</sub></span>
        – коэффициент поглощения j-го компонента;
      </p>
      <p>
        <span class="formula-font">C<sub>j</sub></span>
        – концентрация j-го компонента в смеси.
      </p> -->
    </div>
    <p>
      <!-- В свою очередь формула с учетом изложенного может быть представлена в следующей форме (7): -->
      {{ abstract.p17 }}
    </p>
    <div class="formula-wrap">
      <p class="formula">
        J ⋅ d<span class="symbol">n</span> = J<sub>0</sub> ⋅ e<sup>- A ⋅ C<sub>x</sub></sup> ⋅ d<span class="symbol">n</span>
      </p>
      <span class="formula-num">(7)</span>
    </div>
    <div class="desc">
      {{ abstract.where }}
      <p>
        <!-- А — новый коэффициент, не зависящий от концентрации и характерный для молекулы поглощающего газа. -->
        {{ abstract.p18 }}
      </p>
    </div>
    <p>
      <!-- Как показал проведенный анализ, имеется возможность использовать известные методы для
      построения проектируемого устройства. Использование оптического метода с применением современных
      средств оптики и микроэлектроники позволит создать устройство с высоким быстродействием для
      определения концентрации метана в условиях угольной шахты с улучшенными эксплуатационными
      и метрологическими характеристиками. -->
      {{ abstract.p19 }}
    </p>
    <h2 id="factors">
      {{ titles.t6 }}
    </h2>
    <p>
      <!-- Проанализировав средства контроля, которые основаны на оптико-абсорбционном методе измерения,
      был обнаружен ряд дестабилизирующих факторов: угольная пыль, наличие газов и пары воды,
      температура и атмосферное давление. Одним из основных дестабилизирующих факторов рудничной
      атмосферы является наличие угольной пыли в открытом оптическом канале измерителя, так как свет,
      проходя через пылегазовую среду, ослабляется в результате рассеяния и поглощения (абсорбции). Пыль
      также оседает на оптических элементах, и ведет к снижению метрологической надежности, ухудшается
      прозрачность оптических компонентов. Для повышения точности измерителя необходимо исследовать
      рассеяния ИК-излучения частицами пыли в рабочем оптическом канале и процесс формирования пленки
      пыли на оптических компонентах, разработать метод компенсации влияния пыли на результаты измерений.
      Свет, проходящий через среду в которой выполняются измерения, ослабляется в результате
      рассеяния и поглощения (абсорбции). Интенсивность рассеяния света не постоянна и изменяется в
      зависимости от размеров частиц пыли, концентрации пыли в канале, коэффициента преломления и угла
      рассеяния между направлениями падающего и рассеянного света.
      Наличие пыли в канале приводит к процессу формирования пленки пыли на оптических компонентах. -->
      {{ abstract.p20 }}
    </p>
    <h2 id="development">
      {{ titles.t7 }}
    </h2>
    <p>
      <!-- В оптическом газоанализаторе для увеличения стабильности нуля, а также для
      компенсации возможного влияния влаги, пыли и других факторов, способных поглощать свет,
      используется автокомпенсационная двухлучевая оптическая схема, в которой измеряется интенсивность
      двух лучей, проходящих по одному и тому же оптическому пути, причём, длина волны одного
      (измерительного) луча находится в области поглощения (3.3 мкм), а другого (опорного) —
      в области прозрачности определяемого газа (2.9 мкм). -->
      {{ abstract.p21.p1 }}
    </p>
    <div class="chart-wrap">
      <img src="~/assets/imgs/gif.gif" :alt="abstract.p21.p2" class="chart">
      <p>
        <!-- Рисунок 2 – Анимация оптических каналов измерителя концентрации метана -->
        {{ abstract.picture }} 5 – {{ abstract.p21.p2 }}
      </p>
      <p>
        <!-- Анимация: количество кадров – 5;
        задержка между кадрами - 1 с; количество циклов повторения – 10; объём – 34 кБ -->
        {{ abstract.p21.p3 }}
      </p>
    </div>
    <div v-html="abstract.p22" />
    <!-- <p>
      Потоки излучения от измерительного  (СИД 1) и компенсационного (СИД 2) светоизлучающих диодов
      поступают на объективы О1 и О3 соответственно, которые в свою очередь
      формируют направленные потоки излучения, поступающие в открытых измерительный ОК2 и
      компенсационный ОК1 открытые оптические каналы. Прошедшие через оптические каналы, инфракрасные потоки поступают на
      объективы О2 и О4, которые фокусируют параллельно направленные потоки излучения,
      в которых располагаются фотодетекторы ФД1 и ФД2 основного измерительного и компенсационного каналов.
      Полученные выходные сигналы
      ФД1 и ФД2 – сигналы тока, значения которых пропорциональны потокам
      основного и компенсационного оптических каналов.
    </p>
    <p>
      В качестве источника инфракрасного излучения измерительного канала ОК1
      целесообразно использовать светоизлучающий диод LED-332-NS [6] с рабочей длиной волны 3,3
      мкм. Для компенсационного канала ОК2 можно использовать светоизлучающий диод
      LED29–PR [6], который имеет рабочую длину волны 2,9 мкм.
    </p>
    <p>
      В качестве фотоприемника можно использовать фотодиоды PD36-10-TEC [6].
    </p> -->
    <h2 id="conclusions">
      {{ titles.t8 }}
    </h2>
    <p>
      <!-- Существующие на сегодняшний день методы и средства измерения концентрации
      метана не обеспечивают необходимое быстродействие
      устройств измерения концентрации метана в условиях угольной шахты.
      Использование оптико-адсорбционного метода, овременных средств оптики и микроэлектроники,
      а так же предложенного способа компенсации влияния угольной пыти на результат измерения концентрации метана
      позволит создать быстродействующий прибор для определения концентрации метана с улучшенными метрологическими
      и эксплуатационными характеристиками. -->
      {{ abstract.p23 }}
    </p>
    <h2 style="text-align: center">
      <!-- На момент написания данного автореферата магистерская работа находится на стадии разработки. -->
      {{ abstract.p24 }}
    </h2>
    <h2 id="literature">
      {{ titles.t9 }}
    </h2>
    <p class="source">
      1.
      <!-- Термокаталитические (термохимические) сенсоры. [Электронный ресурс] – Режим доступа: -->
      {{ abstract.sources.s1 }}
      <a href="http://www.sensorgas.ru/poleznoe.html&art=8" target="_blank">http://www.sensorgas.ru/poleznoe.html&art=8</a>
    </p>
    <p class="source">
      2.
      <!-- Термокондуктометрический метод измерения концентрации газов. [Электронный ресурс] – -->
      <!-- Режим доступа:  -->
      {{ abstract.sources.s2 }}
      <a href="http://ural-test.ru/help/articles/termo-konduktometricheskiy-metod/" target="_blank">http://ural-test.ru/help/articles/termo-konduktometricheskiy-metod/</a>
    </p>
    <p class="source">
      3.
      {{ abstract.sources.s3 }}
      <!-- Бреслер П.И. Оптические абсорбционные газоанализаторы и их применение. – Л.: Энергия, 1980. – 164 с. -->
    </p>
    <p class="source">
      4.
      {{ abstract.sources.s4 }}
      <!-- Карпов Е.Ф., Биренберг И.Э. Автоматическая газовая защита и контроль рудничной атмосферы. – М.: Наука, 1984. – 285с. -->
    </p>
    <p class="source">
      5.
      {{ abstract.sources.s5 }}
      <!-- ГОСТ 24032 – 80. Приборы шахтные газоаналитические. Общие требования, методы
      испытания. – Введ. 01. 01. 1981 /Межгосударственный стандарт. – М.: Издательство
      стандартов, 1980. – 36 с. – (Угольная промышленность). -->
    </p>
    <p class="source">
      6.
      <!-- IBSG [Електронний ресурс]. – Електронные данные. – Режим доступа: -->
      {{ abstract.sources.s6 }}
      <a href="http://www.ibsg-st-petersburg.com" target="_blank">http://www.ibsg-st-petersburg.com</a>.
    </p>
    <p class="source">
      7.
      <!-- Энергетика [Електронний ресурс]. – Електронные данные. – Режим доступа: -->
      {{ abstract.sources.s7 }}
      <a href="http://energetika.in.ua/ru/books/book-1/part-2/section-7/7-5" target="_blank">http://energetika.in.ua/ru/books/book-1/part-2/section-7/7-5</a>.
    </p>
  </section>
</template>

<script>
import { mapState } from 'vuex'

export default {
  head () {
    return {
      title: this.titleHead
    }
  },
  components: {
  },
  computed: {
    ...mapState({
      lang: state => state.currentLang.lang
    }),
    titleHead () {
      if (this.lang === 'en') {
        return `Abstract ${this.$t('titleHead')}`
      }

      return `Реферат ${this.$t('titleHead')}`
    },
    // content () {
    //   return this.$t('abstract.text')
    // },
    title () {
      return this.$t('abstract.title')
    },
    titles () {
      return this.$t('abstract.titles')
    },
    abstract () {
      return this.$t('abstract')
    }
  }
}
</script>

<style lang="scss" scoped>
@import "~/assets/style/media_mixin.scss";
@import "~/assets/style/var.scss";

section {
   text-align: justify;
   font-size: 1.8rem;

   /deep/ p {
     font-size: 1.8rem;
     text-indent: 2.5rem;
     line-height: 2.6rem;
   }

   /deep/ h1 {
     font-size: 3rem;
     text-align: center;
     color: $main-blue;
     margin-bottom: 5rem;
   }

   /deep/ h2 {
    font-size: 2rem;
    color: $main-blue;
    margin-bottom: 2rem;
    margin-top: 3rem;
    text-align: left;
  }
 }

  /deep/ li {
  //  &+& {
     margin-top: .5rem;
  //  }
 }

 /deep/ ul {
   font-size: 1.8rem;
 }

   a {
    text-decoration: none;
    word-wrap: break-word;
    text-align: left;

      &:hover {
        text-decoration: underline;
      }

      &+& {
        margin-top: 1rem;
      }
  }

   .chart-wrap {
    display: flex;
    flex-direction: column;
    align-items: center;
    margin-bottom: 3rem;
    margin-top: 3rem;

    p {
      text-align: center;
      text-indent: 0;
      margin-top: 1rem;
    }
  }

  .chart {
    height: auto;
    width: 100%;
    max-width: 36rem;

    @include tablet {
      width: auto;
      max-width: 100%;
    }
  }

  /deep/ .symbol {
    font-family:Symbol !important;
  }

  .formula {
    height: auto;
    margin: 0 auto;
    width: 100%;
    display: block;
    margin-bottom: 1rem;
    text-align: center;
    font-family: 'Roboto Slab', serif;

    * {
      font-family: 'Roboto Slab', serif;
    }
  }

  /deep/ .formula-font {
    font-family: 'Roboto Slab', serif;
  }

  .formula-wrap {
    display: flex;
    align-items: center;
    flex-direction: column;
    margin: 3rem 0;

    @include tablet {
      flex-direction: row;
    }
  }

  .formula-num {
    font-size: 1.7rem;
    margin-left: 1rem;
  }

  .desc {
    margin-bottom: 2rem;
  }

  .links {
    display: flex;
    flex-direction: column;
    align-items: flex-start;
  }

  .source {
    text-align: left;
  }
 </style>
